var gojsons = {"type":"FeatureCollection","features":[{"type":"Feature","properties":{"pathName":"kustendil","name":"Кюстендил","content":"Само в спомени, предания и народни песни съществуват разкази за пребиваване на Левски в областта –  спомени на Гаврил Попсимеонов от с. Вирче, песен за Апостола в с. Брестово – община Симитли. Според спомените за Апостола на Гаврил Попсимеонов самият той го съпровожда при идването му в Кюстендил през 1872 г. и в манастира „Св. Йоаким Осоговски“. Доказано е, че в този край мисия за изграждане на комитетска мрежа осъществява според даденото му от Левски пълномощно учителят от Етрополе Тодор Пеев.","type":"province"},"geometry":{"type":"Point","coordinates":[22.939453125,42.21224516288584]}},{"type":"Feature","properties":{"pathName":"sofia","name":"София","content":"За първи път забързаните стъпки на Дякона преминават през Софийско в началото на март 1862 г. на път за Белград за постъпване в легията на Раковски. От есента на 1871 г. създава частни революционни комитети в София и в селата Биримирци, Горубляне, Герман, Враждебна, Панчарево, Слатина, Бистрица, Подуене, както и в почти всички селища в Ботевградско и Етрополско /една от най-гъстите и многобройни комитетски мрежи/, а също и на юг от Стара планина – в Златишко-Пирдопския край, Копривщица и др.","type":"province"},"geometry":{"type":"Point","coordinates":[23.620605468750004,42.70665956351041]}},{"type":"Feature","properties":{"pathName":"pernik","name":"Перник","content":"Няма сигурни данни Вътреш ната революционна организация, изградена от Апостола на свободата, да има дейност в този най-западен край на днешна България. Определени са Тодор Пеев и поп Георги Тутмаников да работят по тези места. Населението отдава своя поклон чрез издигането на паметници в Перник и Радомир.","type":"province"},"geometry":{"type":"Point","coordinates":[22.884521484375004,42.593532625649935]}},{"type":"Feature","properties":{"pathName":"blagoevgrad","name":"Благоевград","content":"Левски се стреми да разпростре революционната организация по всички български земи. В писмо до Райчо Попхристов в Плоещ от 20.06.1871 г. Левски подчертава, че изграждането на революционни комитети „...наредено е да се извърши и там в Мехомия“. Хр. Г. Данов му препоръчва Михаил Костенцев и ги запознава. Апостола му предава 12 прокламации за Кюстендил, Крива Паланка, Щип, Струмица, Сер, Мелник, Тиквещ, Прилеп, Охрид и Струма. Според спомени на местни дейци Апостола е посещавал и селищата по р. Струма – Горна Джумая (дн. Благоевград), Дупница, с. Рила, с. Белица, с. Покровник, Рилския манастир, Елешнишкият манастир (сега с. Йорданкино).","type":"province"},"geometry":{"type":"Point","coordinates":[23.433837890625,41.705728515237524]}},{"type":"Feature","properties":{"pathName":"pazardzhik","name":"Пазарджик","content":"Васил Левски отрежда достойно място в изгражданата от него революционна организация на Пазарджишкия край. Той е важен стратегически център на комитетите на юг от Балкана. Пазарджик е вторият окръжен център във Вътрешната революционна организация.","type":"province"},"geometry":{"type":"Point","coordinates":[24.180908203125,42.13082130188811]}},{"type":"Feature","properties":{"pathName":"plovdiv","name":"Пловдив","content":"Разположена в сърцето на българските земи, областта заема важно място в изградената от Васил Левски комитетска мрежа. Тук, в своя роден край, той знае най-добре на кого може да довери опасното дело, да бъде препоръчан и да му бъдат препоръчани надеждни хора. Конспиративният характер на дейността му не позволява да остави навсякъде веществени следи за нея. Село Маджере (сега Бегунци), споменато в личния бележник на Апостола, както и съседното село Богаза (сега Пролом), са изпепелени до основи по време на „Страшното“ – от юли до декември 1877 г. в Карловско безчинства редовна турска войска и башибозук. Споменът за посещенията на Апостола в тези села е запазила само народната памет. Тя свидетелства и за присъствието му в Асеновград и манастира „Света Петка“ (Мулдавска), както и на други места.","type":"province"},"geometry":{"type":"Point","coordinates":[24.80679670630957,42.29781144879032]}},{"type":"Feature","properties":{"pathName":"smolian","name":"Смолян","content":"Няма документални свидетелства Апостола да е стигнал в организационните си обиколки до днешната Смолянска област. Само в спомени се разказва, че към 1870 г. Стойо Боботанов приема Левски в дома си в Райково или за посещения в други родопски села.","type":"province"},"geometry":{"type":"Point","coordinates":[24.701848983240783,41.575555594338894]}},{"type":"Feature","properties":{"pathName":"kardzhali","name":"Кърджали","content":"И в тази област, въпреки че Апостола не е посещавал места в нея, жителите ѝ проявяват отношението си към Апостола на свободата с изграждане на паметници и паметни знаци. Училища, читалища и други организации носят неговото име.","type":"province"},"geometry":{"type":"Point","coordinates":[25.52410826664268,41.429282970993015]}},{"type":"Feature","properties":{"pathName":"haskovo","name":"Хасково","content":"Няколко пъти Апостола посещава Хасковския край. На път за Цариград около 10 август 1871 г., в края на октомври – началото на ноември 1872 г. Комитети са изградени и в немалко селища в този край – Свиленград, Ябълково, Странско, Горски извор и др. Въпреки риска, Апостола посещава и Узунджово за закупуване на оръжие от големия панаир там.","type":"province"},"geometry":{"type":"Point","coordinates":[25.949707031250004,41.89409955811395]}},{"type":"Feature","properties":{"pathName":"sliven","name":"Сливен","content":"Като знаменосец на четата на Панайот Хитов през 1867 г. Васил Левски преминава през Сливенския дял на Стара планина. Пътят му минава по тези места в началото и през лятото на 1869 г., през есента на 1871 г. Създадени са комитети в Сливен, Нова Загора, Любенова махала, Дядово, Богданово, Радево, Млекарево, Сокол, Любенец, Пет могили. На 9 ноември 1872 г. Апостола обявява писмено Сливенския комитет за окръжен център. Йордан Стоянов от Котел – син на сестрата на Г. Раковски – Неша, получава пълномощно от Апостола да отговаря за районите на Котленско, Ескиджумайско (дн. Търговишко), Османпазарско (дн. Омуртагско), Провадийско, Хаджиолупазарджишко (дн. Добричко), до Тулчанско.","type":"province"},"geometry":{"type":"Point","coordinates":[26.19140625,42.68243539838623]}},{"type":"Feature","properties":{"pathName":"yambol","name":"Ямбол","content":"Няма данни за революционна дейност на Васил Левски в района. Не е изключено пътят му да е минавал през някои селища в Ямболско при пътуванията си през Тракия.","type":"province"},"geometry":{"type":"Point","coordinates":[26.652832031250004,42.30169032824452]}},{"type":"Feature","properties":{"pathName":"burgas","name":"Бургас","content":"Надеждни писмени източници липсват, но народната памет е съхранила свидетелства за преминаванията на Апостола през Бургаско и Странджа в периода 1868 – 1872 г. Според тях Левски е доведен от с. Звездец в с. Бръшлян от Желю Недков и Никола Сармуков. Среща се с поп Петър Киприлов и нощува в чорбаджи Петко. На другия ден с Киприлов се отправят за с. Чеглаик и Лозенград, където и сега се разказват предания за тях. Mрез есента на 1872 г. Апостола минава през Сливен, Котел, Карнобат.","type":"province"},"geometry":{"type":"Point","coordinates":[27.202148437500004,42.553080288955826]}},{"type":"Feature","properties":{"pathName":"varna","name":"Варна","content":"Няма запазени автентични документи за дейност на Васил Левски във Варненско. Смята се, че по време на двете си обиколки от Търну Мъгуреле през Русе към Цариград Левски минава и през Варна, от където се качва на кораб за османската столица. До основаване на революционни комитети в региона не се стига. Много е вероятно Левски да е минал през Варненско и по пътя си към селата Конгас и Еникьой, където учителства за кратко, след като напуска с. Войнягово през 1866 г.","type":"province"},"geometry":{"type":"Point","coordinates":[27.608642578125004,43.14909399920127]}},{"type":"Feature","properties":{"pathName":"dobrich","name":"Добрич","content":"Няма данни за създаването на комитетска мрежа от Левски в Добричка област. Не е изключено все пак Апостола да е минавал от там след като напуска с. Войнягово и продължава своята учителска дейност в българските села Конгас и Еникьой в Северна Добруджа. Въпреки това, документи за срещи с дейци от този район не са установени.","type":"province"},"geometry":{"type":"Point","coordinates":[27.905273437500004,43.620170616189924]}},{"type":"Feature","properties":{"pathName":"silistra","name":"Силистра","content":"Известно е, че четата на Панайот Хитов минава през Силистренския район. Точното място, където тя стъпва на българския бряг не е изяснено, но се смята, че това става източно от Тутракан около с. Пожарево.","type":"province"},"geometry":{"type":"Point","coordinates":[27.070312500000004,43.866218006556394]}},{"type":"Feature","properties":{"pathName":"stara_zagora","name":"Стара Загора","content":"Апостола познава добре Старозагорския край още от пребиваването си в града и обиколките в близките селища през 1855 – 1858 г. На 6 ноември 1872 г. той провъзгласява местния ЧРК за окръжен, към който спадат Чирпан, Нова Загора, Казанлък и околните им села. В края на януари 1873 г. съратници от Чирпан, Стара Загора и други южнобългарски комитети замислят план за освобождаването на В. Левски, като организират чета, която да спре влака към Цариград.","type":"province"},"geometry":{"type":"Point","coordinates":[25.516846105456356,42.459130214547905]}},{"type":"Feature","properties":{"pathName":"shumen","name":"Шумен","content":"Апостола е минал през Шуменския регион по време на своите пътувания с влак по линията Русе-Варна на път за Цариград, за да осъществи двете си обиколки. До основаване на комитети тук не се стига. Това може да се обясни с наличието на голям брой турски войски и укрепления, но е факт, че през 1873-1875 г., след установяването на Панайот Волов в града, Шуменският комитет е един от най-активните в цялата страна.","type":"province"},"geometry":{"type":"Point","coordinates":[26.996988003860004,43.32166431135426]}},{"type":"Feature","properties":{"pathName":"razgrad","name":"Разград","content":"Известно е, че четата на Панайот Хитов, в която Васил Левски е знаменосец, минава през разградските села Побит Камък и Благоево. Няма документални данни във времето на апостолската си дейност Левски да е посещавал Разградския регион, но сред местните жители се разказва за негови посещения. В този край с пълномощно от Апостола работи Ангел Кънчев. Той трябва да организира и състави частни комитети.","type":"province"},"geometry":{"type":"Point","coordinates":[26.623985992486816,43.564588401321025]}},{"type":"Feature","properties":{"pathName":"targovishte","name":"Търговище","content":"Посещението на Левски в района на Търговище датира от времето, когато той е знаменосец на войводата Панайот Хитов. Вероятно четата минава източно от град Попово по пътя си към Балкана като маршрутът ѝ продължава към с. Пролаз и на юг между Омуртаг и с. Камбурово към селата Горско село и Зелена морава. От там четата се отправя към Котленския балкан. Други данни за активна комитетска дейност в района не са установени.","type":"province"},"geometry":{"type":"Point","coordinates":[26.3232421875,43.15710884095329]}},{"type":"Feature","properties":{"pathName":"ruse","name":"Русе","content":"Комитетската мрежа в района не е силно развита, но през Русе е един от сигурните пътища за преминаване от Влашко към българските земи. От тук минава и каналът за кореспонденция и връзка на Левски и Вътрешната организация с БРЦК и емиграцията Букурещ – Гюргево – Русе – Търново.","type":"province"},"geometry":{"type":"Point","coordinates":[26.040572590082522,43.67531448230814]}},{"type":"Feature","properties":{"pathName":"veliko_tarnovo","name":"Велико Търново","content":"Първите контакти на Апостола със старата столица вероятно датират още от Първата му обиколка по българските земи, но основите на комитетската организация се полагат по-късно. От 1871 г. като главен се налага тайният пощенски канал на Вътрешната организация Гюргево – Русе – Горна Оряховица – Търново към Южна България. Тръгвайки по стъпките на Левски в Търновския край се оформят впечатляващи „маршрути на паметта“. В редица случаи историята и митологията се преплитат. Създадените духовни и културни пространства в отделните селища като музеи, паметници, манастирски обители и др., пазят жива паметта за делото Апостола.","type":"province"},"geometry":{"type":"Point","coordinates":[25.667570578709327,43.27296245194755]}},{"type":"Feature","properties":{"pathName":"gabrovo","name":"Габрово","content":"През 1870 г., изпълняващ своята апостолска мисия, заедно с Матей Преображенски, Левски минава през Габровския регион. По-късно през 1871 г. той отново посещава Габровско заедно с помощниците си Ангел Кънчев и Димитър Общи. Апостола намира верни съмишленици в много от селищата в Габровския край, в някои от които създава комитети.","type":"province"},"geometry":{"type":"Point","coordinates":[25.2685546875,42.90816007196054]}},{"type":"Feature","properties":{"pathName":"pleven","name":"Плевен","content":"За първи път Апостола минава през Плевенския регион на връщане от първата си обиколка в началото на 1869 г. по пътя от Ловеч към Никопол. От там е неговият маршрут Турну Мъгуреле – Никопол – Ловеч – Троян към Южна България и обратно и той многократно посещава този край. През 1871 г. Левски обикаля Плевенско заедно със своя верен помощник Ангел Кънчев. Известно е, че в края на 1871 г. Апостола е в Червен бряг и Телиш, като след това остава за една седмица в Плевен.","type":"province"},"geometry":{"type":"Point","coordinates":[24.77810424389625,43.43977784402131]}},{"type":"Feature","properties":{"pathName":"lovech","name":"Ловеч","content":"Ловешкият край е един от районите най-плътно покрити с местни комитетски структури. Вероятно Апостола посещава Ловеч още по време на Първата си обиколка в началото на 1869 г. През целия период на организационната си работа Левски често минава през Ловешкия регион. От там преминава и един от неговите тайни маршрути, идвайки от Никопол и Плевен, към Троян и от там към Южна България. От Ловеч е и неговата отправна точка на изток към Търновско, а също и към селищата в Предбалкана – Голям Извор, Гложене и Тетевен, както и към Ботевградския район. Много от местата, свързани с дейността на Левски в Ловешка област, са запазени и до наши дни или са възстановени.","type":"province"},"geometry":{"type":"Point","coordinates":[24.548564544589667,42.986925558300115]}},{"type":"Feature","properties":{"pathName":"vratsa","name":"Враца","content":"В тази област Васил Левски посещава Оряхово, Враца, Мездра и някои околни села. За част от посещенията му и основаването на революционни комитети в отделни селища информация дават само късни спомени на местни дейци. Обичайният път за Влашко е през Плевен – Никопол – Търну Мъгуреле, но поради съображения за сигурност, той и неговият спътник Марин п. Луканов, тръгвайки за Общото събрание в Букурещ през 1872 г., решават да преминат Дунава при Оряхово. За това пише Левски в тефтерчето си с дата 6 април.","type":"province"},"geometry":{"type":"Point","coordinates":[23.764303905292145,43.32166431135426]}},{"type":"Feature","properties":{"pathName":"montana","name":"Монтана","content":"Селищата от Монтанския край остават встрани от обиколките на Васил Левски и пътищата, познали стъпките му. Оскъдни са сведенията за дейността на Апостола в този район. С нея е свързан гр. Лом. В спомени на негови съвременници се разказва и за посещение на Левски в Берковица, но не са запазени документални свидетелства. Със сигурност се знае, че Левски минава през Берковския балкан през 1867 г. с четата на Панайот Хитов.","type":"province"},"geometry":{"type":"Point","coordinates":[23.22871127357673,43.50221537592194]}},{"type":"Feature","properties":{"pathName":"vidin","name":"Видин","content":"В най-северозападната област на днешна България Васил Левски не изгражда комитетска мрежа. Няма категорични данни по време на своите обиколки той да е посещавал този регион с организационна мисия. Васил Левски минава през Видинския край и посещава някои селища, което оставя спомени в жителите им, през 1868 г. През май Левски напуска Белград и заминава за Влашко. През юни се завръща в Сърбия, арестуван е и прекарва известно време в затвора в Зайчар. След освобождаването му от там той се отправя отново към Румъния и вероятно отново минава през Видинско. В този район през 30-50-те години на XIX в. населението се вдига многократно на бунтове, потушавани жестоко от османските власти, които поддържат там и агентурен апарат. Вероятно това дава своето отражение върху жителите на сели\u0002щата, а също и на преценката на В. Левски за организационната му работа там лично. Признанието и паметта на хората към Апостола е изразено чрез няколко паметни знака – във Видин, Оряхово, Брегово, Кула, Белоградчик.","type":"province"},"geometry":{"type":"Point","coordinates":[22.673990333585795,43.84102121845514]}}]}

var sofiaprovinces = {
    "type": "FeatureCollection",
    "features": 
[{"type":"Feature","properties":{"pathName":"karlovo","gallery":[],"type":"town"},"geometry":{"type":"Point","coordinates":[24.807732123184927,42.64112416948103]}},{"type":"Feature","properties":{"pathName":"klisura","gallery":[],"type":"town"},"geometry":{"type":"Point","coordinates":[24.449746703961683,42.6932711637258]}}]
  }

let monuments = [{"type":"Feature","properties":{"pathName":"karlovo","gallery":[],"type":"town"},"geometry":{"type":"Point","coordinates":[24.807732123184927,42.64112416948103]}},{"type":"Feature","properties":{"pathName":"klisura","gallery":[],"type":"town"},"geometry":{"type":"Point","coordinates":[24.449746703961683,42.6932711637258]}},{"type":"Feature","properties":{"pathName":"pametnik_levski_karlovo","type":"obelisk","iconUrl":true},"geometry":{"type":"Point","coordinates":[24.806077480316162,42.63744662710757]}},{"type":"Feature","properties":{"pathName":"nm_vasil_levski","type":"museum","iconUrl":true},"geometry":{"type":"Point","coordinates":[24.803035151197577,42.642454572161384]}},{"type":"Feature","properties":{"pathName":"im_karlovo","type":"museum","iconUrl":true},"geometry":{"type":"Point","coordinates":[24.806248738383413,42.63667558281461]}},{"type":"Feature","properties":{"pathName":"sv_bogoroditsa_karlovo","type":"church","iconUrl":true},"geometry":{"type":"Point","coordinates":[24.805068328784827,42.638586649832284]}},{"type":"Feature","properties":{"pathName":"house_of_raino","type":"house","iconUrl":true},"geometry":{"type":"Point","coordinates":[24.805863390020118,42.639284055951265]}},{"type":"Feature","properties":{"pathName":"altan_chair","type":"obelisk","iconUrl":true},"geometry":{"type":"Point","coordinates":[24.802386102365254,42.63819428697074]}},{"type":"Feature","properties":{"pathName":"karaivanov_han","type":"obelisk","iconUrl":true},"geometry":{"type":"Point","coordinates":[24.803105171108683,42.64304282279323]}},{"type":"Feature","properties":{"pathName":"buhalov_han","type":"house","iconUrl":true},"geometry":{"type":"Point","coordinates":[24.8058204605429,42.638889214322546]}},{"type":"Feature","properties":{"pathName":"house_tachevi","type":"house","iconUrl":true},"geometry":{"type":"Point","coordinates":[24.802815397137472,42.63982103654546]}},{"type":"Feature","properties":{"pathName":"house_grozev","type":"house","iconUrl":true},"geometry":{"type":"Point","coordinates":[24.80549848946374,42.63768888038569]}},{"type":"Feature","properties":{"pathName":"znak_madzharetsa","type":"obelisk","iconUrl":true},"geometry":{"type":"Point","coordinates":[24.8110149272866,42.636291093923646]}},{"type":"Feature","properties":{"pathName":"mlatishumka","type":"obelisk","iconUrl":true},"geometry":{"type":"Point","coordinates":[24.81046815590431,42.61908562207287]}}].filter(rec => {
  if (rec.properties.iconUrl) {
    return rec;
  }
});

console.log(JSON.stringify(monuments));

var monumentsGeoJSON = {
  "type": "FeatureCollection",
  "features": [
      {
          "type": "Feature",
          "properties": {
              "pathName": "pametnik_levski_karlovo",
              "gallery": [
                  "Паметникът на Васил Левски в Карлово"
              ],
              "name": "Паметникът на Васил Левски в Карлово",
              "type": "obelisk",
              "content": "Паметникът на Апостола на пл. „Васил Левски“ с мото „Нам свобода и човешки правдини трябват“ – скулптор Марин Василев. На 15.05.1903 г. е положен основният камък в присъствието на княз Фердинанд и министри, а на 12.08.1907 г. окончателно е приет от специална комисия. На пиедестала има три релефа: „Създаване на революционен комитет”, „Залавянето на Левски” и „Извеждане на карловските въстаници от конака”. В гранита са изписани имената на избитите през „Страшното“ карловци. На върха е фигурата на Апостола.",
              "iconUrl": true
          },
          "geometry": {
              "type": "Point",
              "coordinates": [
                  24.806077480316162,
                  42.63744662710757
              ]
          }
      },
      {
          "type": "Feature",
          "properties": {
              "pathName": "nm_vasil_levski",
              "gallery": [
                  "Родната къща на Апостола в Карлово",
                  "Експозицията на НМ „Васил Левски“",
                  "Паметникът на Гина Кунчева, НМ „Васил Левски“",
                  "Мемориален параклис „Всех святих болгарских“, НМ „Васил Левски“",
                  "Онбашиевата къща, НМ „Васил Левски“",
                  "Чардаклиевата къща, НМ „Васил Левски“"
              ],
              "name": "НМ „Васил Левски“",
              "type": "museum",
              "content": "Близо 90 години родната къща на Апостола е музей, свято място за всички българи. Началото му е свързано с нейното възстановяване през 1933 г. и отварянето ѝ като къща музей през 1937 г. Първоначално за нея се грижи общественият комитет, който я възстановява и читалището в града. За пръв уредник на музея е назначен Никола Славчев. През 1954 г. къща музей „Васил Левски“ е включена в държавната музейна мрежа. През 1955 г. в близост до нея е изградена зала за документална експозиция. Когато тя се оказва малка, през 1965 г. в съседство е построена нова сграда – експозиционна зала на музея и в днешно време. От 1968 г. до 1992 г. къщата музей на Апостола е филиал на Градския исторически музей – Карлово, а от 1993 г. е самостоятелен музей. На 21 юли 2000 г. е обявен за държавен културен институт с национално значение и наименование Музей „Васил Левски“ – Карлово. Така той заема своето подобаващо място като национален мемориален музей, посветен на един от най-бележитите българи. От 1994 г. до 2011 г. се реализира проект с автор арх. Мария Каразлатева за възстановяване на околната среда на родния дом на Апостола, разрушена в голяма степен през 50-те и 60-те години на ХХ век. Чрез проекта се разширява музейният комплекс, като в него се включват двете възстановени възрожденски къщи в съседство с родната на Левски – Чардаклиевата и Онбашиевата, и мемориалният параклис „Всех святих болгарских“, в който се съхраняват косите на Апостола. В двора на музея се намира паметникът на неговата майка Гина Кунчева, 1973 г.",
              "iconUrl": true
          },
          "geometry": {
              "type": "Point",
              "coordinates": [
                  24.803035151197577,
                  42.642454572161384
              ]
          }
      },
      {
          "type": "Feature",
          "properties": {
              "pathName": "im_karlovo",
              "gallery": [
                  "Исторически музей - Карлово",
                  "Исторически музей - Карлово"
              ],
              "name": "Исторически музей - Карлово",
              "type": "museum",
              "content": "В експозицията на Градския исторически музей в Карлово са представени материали за сподвижниците на Левски и революционния комитет.",
              "iconUrl": true
          },
          "geometry": {
              "type": "Point",
              "coordinates": [
                  24.806248738383413,
                  42.63667558281461
              ]
          }
      },
      {
          "type": "Feature",
          "properties": {
              "pathName": "sv_bogoroditsa_karlovo",
              "gallery": [
                  "Църквата „Св. Богородица“"
              ],
              "name": "Църквата „Св. Богородица“",
              "type": "church",
              "content": "В двора на църквата „Св. Богородица“ се е намирал Хилендарският метох, където служи хаджи Василий със своя племенник и послушник Васил Иванов Кунчев. Под свода на храма често звучи ангелският му глас и неговото любимо „Достойно ест“. Тук през 1859 г. той е ръкоположен в йеродяконски сан от пловдивския митрополит Паисий. Този момент е изобразен на северната фасада на църквата от карловския художник Дечко Тодоров през 1997 г.",
              "iconUrl": true
          },
          "geometry": {
              "type": "Point",
              "coordinates": [
                  24.805068328784827,
                  42.638586649832284
              ]
          }
      },
      {
          "type": "Feature",
          "properties": {
              "pathName": "house_of_raino_popovich",
              "gallery": [
                  "Къщата на Райно Попович"
              ],
              "name": "Къщата на Райно Попович",
              "type": "house",
              "content": "Къщата на даскал Райно Попович на ул. „В. Левски“ № 27. Васил Иванов Кунчев учи при него църковнославянски език, църковна история и църковно пеене. Със сина на Попович – Теофан, са връстници и приятели. Зет му – д-р Киро Попов, е член на Карловския революционен комитет и неведнъж посреща Апостола в този дом, включително и при последното минаване на Левски през Карлово в началото на декември 1872 г.",
              "iconUrl": true
          },
          "geometry": {
              "type": "Point",
              "coordinates": [
                  24.805863390020118,
                  42.639284055951265
              ]
          }
      },
      {
          "type": "Feature",
          "properties": {
              "pathName": "altan_chair",
              "gallery": [
                  "Местността „Алтън Чаир“"
              ],
              "name": "Местността „Алтън Чаир“",
              "type": "obelisk",
              "content": "Местността „Алтън чаир” (Златна ливада), на пресечката на ул. „В. Караиванов“ и ул. „Хр. Ботев“ – на Великден (19 април) 1864 г. в присъствие на приятелите си хаджи Георги Попхристов и Христо Пулев дякон Игнатий отрязва монашеските си коси и снема расото, за да поеме по пътя на революцията.",
              "iconUrl": true
          },
          "geometry": {
              "type": "Point",
              "coordinates": [
                  24.802386102365254,
                  42.63819428697074
              ]
          }
      },
      {
          "type": "Feature",
          "properties": {
              "pathName": "karaivanov_han",
              "gallery": [
                  "Караивановият хан"
              ],
              "name": "Караивановият хан",
              "type": "obelisk",
              "content": "Караивановият хан, известен като „комитетски хан“, строен в началото на ХІХ в., е собственост на Генчо Караиванов, после на сина му Васил – първи братовчед на Васил Левски, касиер на Карловския революционен комитет. Мястото е отбелязано с паметен знак срещу родната къща на Апостола.",
              "iconUrl": true
          },
          "geometry": {
              "type": "Point",
              "coordinates": [
                  24.803105171108683,
                  42.64304282279323
              ]
          }
      },
      {
          "type": "Feature",
          "properties": {
              "pathName": "buhalov_han",
              "gallery": [
                  "Бухаловият хан"
              ],
              "name": "Бухаловият хан",
              "type": "house",
              "content": "Бухаловият хан е построен в средата на ХІХ век от Кирко Бухала. Приземният етаж е нает от карловските революционери за комитетско кафене. Тотоолувото кафене (отдясно до хана) е строено от Христо Тотоолу. Тук през 1869 г. по поръка на Апостола е основано Въздържателно дружество.",
              "iconUrl": true
          },
          "geometry": {
              "type": "Point",
              "coordinates": [
                  24.8058204605429,
                  42.638889214322546
              ]
          }
      },
      {
          "type": "Feature",
          "properties": {
              "pathName": "house_tachevi",
              "gallery": [
                  "Къщата на Неда и Гана Тачеви"
              ],
              "name": "Къщата на Неда и Гана Тачеви",
              "type": "house",
              "content": "Домът на Неда и Гана Тачеви на ул. „В. Караиванов“ № 33 е една от тайните къщи на Апостола в града.",
              "iconUrl": true
          },
          "geometry": {
              "type": "Point",
              "coordinates": [
                  24.802815397137472,
                  42.63982103654546
              ]
          }
      },
      {
          "type": "Feature",
          "properties": {
              "pathName": "house_of_ivan_grozev",
              "gallery": [
                  "Къщата на Иван Грозев"
              ],
              "name": "Къщата на Иван Грозев",
              "type": "house",
              "content": "Къщата на Иван Грозев, приятел и съмишленик на Апостола (ул. „В. Левски“ 42). Той разказва на Иван Вазов за случилото се на Чукурлийския баир и става герой в разказа му „Чистият път”. След Освобождението е виден индустриалец, кмет на Карлово и на София, народен представител. През 2019 г. е реставрирана от Българската търговско-промишлена палата. На първия етаж е уредена експозиция за живота на Иван Грозев.",
              "iconUrl": true
          },
          "geometry": {
              "type": "Point",
              "coordinates": [
                  24.80549848946374,
                  42.63768888038569
              ]
          }
      },
      {
          "type": "Feature",
          "properties": {
              "pathName": "znak_madzharetsa",
              "gallery": [
                  "Знак за Ганю Маджереца"
              ],
              "name": "Знак за Ганю Маджереца",
              "type": "obelisk",
              "content": "Паметен знак за съратника на Апостола – Ганю Маджереца, куриер на организацията, наричан „Тракийската поща“, стопанин на тайна къща, в която посреща Левски, а по-късно и апостолите на IV революционен окръг. Дъщеря му – Мария Ганева, ушила знамето на Карловския комитет по лично указание на Левски. Скулптор е Иван Томанов (ул. „Г. Маджереца“, до „Желязков мост“).",
              "iconUrl": true
          },
          "geometry": {
              "type": "Point",
              "coordinates": [
                  24.8110149272866,
                  42.636291093923646
              ]
          }
      },
      {
          "type": "Feature",
          "properties": {
              "pathName": "mlatishumka",
              "gallery": ["Местността „Млатишумка“"
          ],
          "name": "Местността „Млатишумка“",
          "type": "obelisk",
          "content": "Паметна морена в местността Млатишумка, където Васил Левски събира своите съмишленици, за да поставят началото на революционния комитет в Карлово. Намира се извън града, под южната промишлена зона.",
          "iconUrl": true
      },
      "geometry": {
          "type": "Point",
          "coordinates": [
              24.81046815590431,
              42.61908562207287
          ]
      }
  },
  {
      "type": "Feature",
      "properties": {
          "pathName": "pametnik_sofia",
          "gallery": [
              "Паметникът на Васил Левски в София",
              "Орелефът на Апостола на паметника в София"
          ],
          "name": "Паметникът на Васил Левски в София",
          "type": "obelisk",
          "content": "Паметникът на Васил Левски в София – скулптори Рудолф Вейр и Франтишек Новак, архитект Адолф Колар, каменоделец Абрамо Перукети, е открит на 22.10.1895 г.",
          "iconUrl": true
      },
      "geometry": {
          "type": "Point",
          "coordinates": [
              23.33527151485843,
              42.696661931833205
          ]
      }
  },
  {
      "type": "Feature",
      "properties": {
          "pathName": "nvim",
          "gallery": [
            "Експозицията в Националния военноисторически музей"
          ],
          "name": "НВИМ",
          "type": "museum",
          "content": "В Националния военноисторически музей се съхраняват ценни реликви на Апостола: косата му – отрязана от самия него на Великден 1864 г., съхранявана от майка му и подарена от сестра му Яна на 20 юни 1907 г. с писмо до министъра на Народното просвещение; дяконското кръстче, донесено от Божи гроб от вуйчо му през 1861 г. и предоставено от племенницата на Васил Левски – София Зидарова; тя предоставя и тасчето му, с което пие вода; револверът, система „Гасер“ М 1870, калибър 11 мм.; желязната затворническа верига, с която Апостола е окован, докато е съден.",
          "iconUrl": true
      },
      "geometry": {
          "type": "Point",
          "coordinates": [
              23.35067706716023,
              42.6887519617554
          ]
      }
  },
  {
      "type": "Feature",
      "properties": {
          "pathName": "nim",
          "gallery": [
            "Бронзов бюст на Левски, НИМ",
              "Камата, която Васил Левски оставя на Евгения Бояджиева, НИМ",
          ],
          "name": "НИМ",
          "type": "museum",
          "content": "В Националния исторически музей е експонирана камата, която Васил Левски оставя на учителката Евгения Бояджиева в Карлово, предоставена от нейни наследници през 1978 г.; далекогледът на Апостола, запазен от негови родственици, е предоставен през 1987 г. Представени са и бронзов бюст от скулптора Петър Балабанов; копия на орелефа от паметника в София, на вещи и снимки на В. Левски.",
          "iconUrl": true
      },
      "geometry": {
          "type": "Point",
          "coordinates": [
              23.270878,
              42.655197
          ]
      }
  },
  {
      "type": "Feature",
      "properties": {
          "pathName": "bust_levski_sofia_borisova",
          "gallery": [
              "Бюст паметник на Апостола в Борисовата градина"
          ],
          "name": "Бюст паметник на Апостола в Борисовата градина",
          "type": "obelisk",
          "content": "Бюст паметникът на Васил Левски в Борисовата градина, алея на възрожденците, скулптор Владимир Гиновски, открит през 1992 г.",
          "iconUrl": true
      },
      "geometry": {
          "type": "Point",
          "coordinates": [
              23.3375467,
              42.6865671
          ]
      }
  },
  {
      "type": "Feature",
      "properties": {
          "pathName": "pametnik_levski_sofia_voenna_akademia",
          "gallery": [
              "Паметник на Апостола във Военната академия"
          ],
          "name": "Паметник на Апостола във Военната академия",
          "type": "obelisk",
          "content": "Паметник на Апостола в парка на Военна академия „Георги Ст. Раковски“, открит през 2016 г., скулптор Красимир Ангелов.",
          "iconUrl": true
      },
      "geometry": {
          "type": "Point",
          "coordinates": [
              23.344998,
              42.6913517
          ]
      }
  },
  {
      "type": "Feature",
      "properties": {
          "pathName": "pametnik_levski_sofia_nsa",
          "gallery": [
              "Паметник на Апостола в НСА"
          ],
          "name": "Паметник на Апостола в НСА",
          "type": "obelisk",
          "content": "Паметник на Васил Левски пред ректората на Националната спортна академия, скулптор Лъчезар Даскалов, открит през 2006 г.",
          "iconUrl": true
      },
      "geometry": {
          "type": "Point",
          "coordinates": [
              23.3496827,
              42.6457365
          ]
      }
  },
  {
      "type": "Feature",
      "properties": {
          "pathName": "pametnik_levski_sofia_gerena",
          "gallery": [
              "Паметник на Апостола на Герена"
          ],
          "name": "Паметник на Апостола на Герена",
          "type": "obelisk",
          "content": "Паметникът на Васил Левски в парка пред стадион „Георги Аспарухов“ е открит през 1982 г., скулптор Величко Минеков.",
          "iconUrl": true
      },
      "geometry": {
          "type": "Point",
          "coordinates": [
              23.361932,
              42.703775
          ]
      }
  },
  {
      "type": "Feature",
      "properties": {
          "pathName": "sofia_konak",
          "gallery": [
              "Старият конак"
          ],
          "name": "Старият конак",
          "type": "obelisk",
          "content": "Конакът, където се е състоял съдебният процес срещу Апостола, сега Национална художествена галерия – метална паметна плоча на главния вход.",
          "iconUrl": true
      },
      "geometry": {
          "type": "Point",
          "coordinates": [
              23.3270927,
              42.6961776
          ]
      }
  },
  {
      "type": "Feature",
      "properties": {
          "pathName": "bust_levski_sofia_vrazhdebna",
          "gallery": [
              "Паметникът на Васил Левски във Враждебна",
              "Морена на мястото на Вълчовия хан във Враждебна"
          ],
          "name": "Паметникът на Васил Левски във Враждебна",
          "type": "obelisk",
          "content": "Бюст паметникът на Васил Левски с надпис „Умря, за да живее” в с. Враждебна (сега квартал), скулптор Димо Бойчев, открит през 2021 г.",
          "iconUrl": true
      },
      "geometry": {
          "type": "Point",
          "coordinates": [
              23.410692,
              42.711444
          ]
      }
  },
  {
      "type": "Feature",
      "properties": {
          "pathName": "sofia_vele_mitrev",
          "gallery": [
              "Къщата на Веле Митрев"
          ],
          "name": "Къщата на Веле Митрев",
          "type": "house",
          "content": "В къщата на Веле Митрев в с. Биримирци (сега кв. „Бенковски“) е създаден революционен комитет, за което разказва музейна експозиция.",
          "iconUrl": true
      },
      "geometry": {
          "type": "Point",
          "coordinates": [
              23.3444223,
              42.7357784
          ]
      }
  },
  {
      "type": "Feature",
      "properties": {
          "pathName": "bust_sofia_gorubliane",
          "gallery": [
              "Паметникът на Васил Левски в Горубляне"
          ],
          "name": "Паметникът на Васил Левски в Горубляне",
          "type": "obelisk",
          "content": "Бюст паметник на Васил Левски има и в кв. „Горубляне“, пред читалищната сграда, скулптор Христо Танев.",
          "iconUrl": true
      },
      "geometry": {
          "type": "Point",
          "coordinates": [
              23.410142,
              42.635412
          ]
      }
  },
  {
      "type": "Feature",
      "properties": {
          "pathName": "dragalevski_manastir",
          "gallery": [
              "Драгалевският манастир"
          ],
          "name": "Драгалевският манастир",
          "type": "church",
          "content": "Драгалевският манастир с паметна плоча за посещенията на В. Левски в светата обител. Нейните врати били широко отворени както за Апостола, така и за други комитетски дейци – игумен на манастира бил старият другар на Левски още от Първата български легия йеромонах Генадий Ихтимански, с когото заедно заминали за Белград. Той бил един от най-доверените съратници на Апостола в революционната му дейност в Софийско, придружавал го и при някои от посещенията му из околните села и манастири.",
          "iconUrl": true
      },
      "geometry": {
          "type": "Point",
          "coordinates": [
              23.2968004,
              42.6189767
          ]
      }
  },
  {
      "type": "Feature",
      "properties": {
          "pathName": "sopotski_manastir",
          "gallery": [
              "Сопотски манастир „Св. Спас“"
          ],
          "name": "Сопотски манастир „Св. Спас“",
          "type": "church",
          "content": "Манастирът „Възнесение Господне“ („Св. Спас“), опожарен през 1877 г., е изграден в сегашния си вид през 1879 г. Тук на 7 декември 1858 г. под мантията на йеромонах Кирил, Васил Иванов Кунчев приема монашеството и името Игнатий. По-късно игуменът отец Рафаил и дякон Богослов членуват в местния комитет.",
          "iconUrl": true
      },
      "geometry": {
          "type": "Point",
          "coordinates": [
              24.74992773631152,
              42.66420506904837
          ]
      }
  },
  {
      "type": "Feature",
      "properties": {
          "pathName": "sopot_pametnik",
          "gallery": ["Паметникът на Васил Левски в Сопот"],
          "name": "Паметник на Васил Левски в Сопот",
          "type": "obelisk",
          "content": "Паметникът на Васил Левски в централната част на града на мястото на къщата на Тодор Кошников, открит през 2013 г., скулптор Недко Кръстев.",
          "iconUrl": true
      },
      "geometry": {
          "type": "Point",
          "coordinates": [
              24.757486581802368,
              42.65485629896077
          ]
      }
  },
  {
      "type": "Feature",
      "properties": {
          "pathName": "sopot_metoh",
          "gallery": ["Девическият метох"],
          "name": "Девическият метох",
          "type": "church",
          "content": "Девическият манастир „Въведение Богородично“ (Метоха), неколкократно разоряван и въздиган. В западното жилищно крило с чардаците е скривалището на Васил Левски под килията на игуменката Христина, където са уреждани и срещи на комитетски дейци.",
          "iconUrl": true
      },
      "geometry": {
          "type": "Point",
          "gallery": [],
          "coordinates": [
              24.758419990539554,
              42.65529816586473
          ]
      }
  },
  {
      "type": "Feature",
      "properties": {
          "pathName": "glozhenski_manastir",
          "gallery": [
              "Гложенският манастир",
              "Средновековният подземен тунел в Гложенския манастир"
          ],
          "type": "church",
          "content": "Васил Левски винаги намира прием и сигурно убежище в манастира „Св. Георги Победоносец“ до с. Гложене, община Тетевен, известен като Гложенския манастир. Един от неговите игумени – хаджи Евтимий Симеонов от Сопот, е доверен човек на Апостола. Васил Левски основава в с. Гложене един от най-многочислените комитети с председател Васил Йонков – Гложенеца. Запазено е скривалището на Васил Левски. В манастира е имало подземен тунел, прокопан още при изграждането на манастира.",
          "name": "Гложенският манастир",
          "iconUrl": true
      },
      "geometry": {
          "type": "Point",
          "coordinates": [
              24.16936636072286,
              42.97553923297822
          ]
      }
  },
  {
      "type": "Feature",
      "properties": {
          "pathName": "troianski_manastir",
          "gallery": [
              "Троянски манастир „Успение Богородично“",
              "Паметна плоча за Апостола"
          ],
          "type": "church",
          "content": "В Троянския манастир „Успение Богородично“ Апостола намира убежище и верни съратници сред монасите, които създават през 1872 г. революционен комитет в светата обител, начело с игумена хаджи Макарий. В манастира се намира стая-скривалище на Васил Левски. То е достъпно за туристи и разкрива двата тайни изхода – към реката и към гората. Още през 1895 г. архимандрит Партений Дамянов, игумен на манастира, събира и нарежда в своеобразна музейна експозиция запазените от тайния монашески комитет вещи, някои принадлежали на самия йеродякон Игнатий.",
          "name": "Троянският манастир",
          "iconUrl": true
      },
      "geometry": {
          "type": "Point",
          "coordinates": [
              24.780769191217555,
              42.86192812981986
          ]
      }
  },
  {
      "type": "Feature",
      "properties": {
          "pathName": "sokolski_manastir",
          "gallery": [
              "Соколският манастир"
          ],
          "type": "church",
          "content": "В годините до Освобождението манастирът „Успение Богородично” – Соколският, недалеч от Габрово, e давал убежище на Васил Левски, на четата на капитан дядо Никола, на четниците на Цанко Дюстабанов по време на Априлското въстание.",
          "name": "Соколският манастир",
          "iconUrl": true
      },
      "geometry": {
          "type": "Point",
          "coordinates": [
              25.338546000684115,
              42.79713418718773
          ]
      }
  },
  {
      "type": "Feature",
      "properties": {
          "pathName": "preobrazhenski_manastir",
          "gallery": [
              "Преображенският манастир",
              "Паметна плоча до убежището на отец Матей Преображенски - Миткалото"
          ],
          "type": "church",
          "content": "Манастирът в близост до града по пътя за Русе е свързан с народополезната дейност на отец Матей Преображенски Миткалото – сподвижник на Апостола. Левски неведнъж намира убежище зад здравите врати на светата обител. За да избегнат възможна опасност, когато Левски е в Търново, заедно с Иван х. Димитров и други младежи отиват в Преображенския манастир. Там Апостола среща стария си другар от Първата българска легия – отец Матей. Той приема да стане помощник в бунтовното дело. Левски остава в манастира 5 дни. Бил изработен план за бъдеща дейност, след което двамата напускат манастира преоблечени като монаси и поемат пътя към Горна Оряховица. През 1987 г. до убежището на отец Матей, където се смята, че е пребивавал и Дякона е поставена паметна плоча. Достъпът до пещерата е труден и трябва да се ползват услугите на водач, познаващ отлично скалния венец.",
          "name": "Преображенският манастир",
          "iconUrl": true
      },
      "geometry": {
          "type": "Point",
          "coordinates": [
              25.606805002155625,
              43.116484000312845
          ]
      }
  },
  {
      "type": "Feature",
      "properties": {
          "pathName": "petropavlovski_manastir",
          "gallery": [
              "Петропавловският манастир",
              "Паметна плоча за Апостола в Петропавловския манастир"
          ],
          "type": "church",
          "content": "В манастира „Св. св. Петър и Павел“, известен като Петропавловския манастир, Апостола основава Лясковския революционен комитет. Според разказа на Христо Иванов–Големия, през 1871 г. Васил Левски, Ангел Кънчев и Димитър Общи, посещават Лясковец и обсъждат с тамошните дейци закона, по който да се водят комитетските дела. През 1872 г. Апостола отсяда отново в манастира с Ангел Кънчев. Посещенията на Васил Левски са увековечени с паметната плоча, поставена в духовната обител.",
          "name": "Петропавловският манастир",
          "iconUrl": true
      },
      "geometry": {
          "type": "Point",
          "coordinates": [
              25.70764811384514,
              43.09520403003208
          ]
      }
  }
]
}

var townsGeoJson = {
  "type": "FeatureCollection",
  "features": 
 [{"type":"Feature","properties":{"pathName":"karlovo",
    "gallery": [
        "Родната къща на Апостола в Карлово",
        "Експозицията на НМ „Васил Левски“",
        "Паметникът на Гина Кунчева, НМ „Васил Левски“",
        "Мемориален параклис „Всех святих болгарских“, НМ „Васил Левски“",
        "Онбашиевата къща, НМ „Васил Левски“",
        "Чардаклиевата къща, НМ „Васил Левски“",
        "Паметникът на Васил Левски в Карлово",
        "Къщата на Райно Попович",
        "Бухаловият хан",
        "Църквата „Св. Богородица“",
        "Местността „Алтън чаир“"
    ],"type":"town","content":"Присъствието на Васил Левски в Карлово не се ограничава с представата за неговия роден дом. Той е само отправна точка към всички онези къщи, църкви, ханове, чешми и улички в стария град, които пазят спомените за Апостола. Някои от тях са съхранени и днес, за други само паметен знак напомня за Левски и апостолската му работа.","name":"Карлово"},"geometry":{"type":"Point","coordinates":[24.807732123184927,42.64112416948103]}},{"type":"Feature","properties":{"pathName":"sofia_city",
    "gallery": [
        "Паметникът на Васил Левски в София",
        "Орелефът на Апостола",
        "Конакът, където се е състоял съдебният процес",
        "Паметникът на Апостола във Враждебна",
        "Къщата на Веле Митрев",
        "Експозицията в Националния военноисторически музей",
        "Бронзов бюст на Левски, НИМ",
        "Драгалевският манастир",
        "Морена на мястото на Вълчовия хан във Враждебна",
        "Паметникът на Апостола в парк „Георги Аспарухов“",
        "Бюст на Апостола в Борисовата градина",
        "Камата, която Васил Левски оставя на Евгения Бояджиева, НИМ",
        "Паметникът на Апостола в кв. Горубляне"
    ],"type":"town","content":"За съжаление архивът на революционния комитет в София е унищожен след ареста на Димитър Общи, за да не попадне в ръцете на властта. Проверени косвени доказателства свидетелстват за дейността и състава му с председател Христо Стоянов, Христо Ковачев – секретар, а Димитър Ножаров – касиер. Комитетските дейци се събират в хановете на хаджи Боне Петров, на Димитър Трайкович, на Хаджи Мано. Апостола неведнъж отсяда в къщата на Йорданка Филаретова, където се укрива и комитетската архива. След залавянето Апостола е докаран на 3 януари 1873 г. в София и затворен в килия в турската казарма, а на следващия ден е изправен пред специалната следствена комисия в конака. На 6/18 февруари приключва земният му път в покрайнините на града близо до мястото, където днес се издига неговият паметник.","name":"София"},"geometry":{"type":"Point","coordinates":[23.320896462195094,42.697900418429484]}},{"type":"Feature","properties":{"pathName":"botevgrad",
    "gallery": [
        "Експозицията на ИМ - Ботевград",
        "Паметникът на Васил Левски в Ботевград"
    ],"type":"town","content":"Сред жителите на Орханийския (Ботевградския) край Апостола намира благоприятна почва за революционна дейност. В града той пристига през лятото на 1870 г. заедно с тетевенския търговец Станчо Хаджииванов и отсядат в Брънчевия (Шарения) хан. На 22 декември с. г. е основан комитетът с председател Васил Петров и негов заместник Гаврил Брънчев. Съзаклятниците се събират и срещат с Левски в къщата на Стоян Цагарски и в хана на Васил Бояджията. В околията Левски изгражда множество комитети: във Врачеш, Скравена, Литаково, Божечица, Правец, Калугерово, Джурово, Видраре, Етрополе, Лопян и др. В Исторически музей – Ботевград е уредена експозиция, представяща дейността на революционния комитет. В целия район между Ловеч и София, вкл. и в Ботевградско са делегирани права за организиране на създадената от Левски революционната мрежа, на Димитър Общи. Бюст паметникът на Васил Левски на централния площад, скулптор Цветослав Христов, открит през 2003 г.","name":"Ботевград"},"geometry":{"type":"Point","coordinates":[23.785085,42.9064052]}},{"type":"Feature","properties":{"pathName":"etropole",
    "gallery": [
        "Исторически музей – Етрополе",
        "Паметна плоча на мястото на къщата на Т. Пеев",
        "Паметна плоча на мястото на къщата на Гр. Спасов",
        "Етрополският манастир „Света Троица”"
    ],"type":"town","content":"През Етрополско В. Левски минава като знаменосец на четата на Панайот Хитов. В личния си бележник Апостола отбелязва посещенията си в града през лятото на 1870 г., декември 1871 г., когато отсяда в Митовия хан, а вечерта организират с учителя Тодор Пеев събрание в тайна къща. Той е избран за председател. Оценявайки неговите качества, Левски му възлага специална мисия за разширяване на революционната организация и създаване на комитети в Кюстендилско, Радомирско, Осоговския манастир, Крива паланка. В Исторически музей – Етрополе се проследява дейността на местния комитет. На видно място е разположена експозицията за Тодор Пеев. Паметна плоча на мястото на къщата на Тодор Пеев, ул. „Тодор Пеев” № 4. Къщата на Григор Спасов и паметна плоча за заседания на местния комитет, ул. „Александър Спасов” № 2. Етрополският манастир „Света Троица” е сигурно убежище за Апостола при игумена Хрисанд. Поставена е паметна плоча на входа на манастира, уредени са експозиция и скривалището на Васил Левски.","name":"Етрополе"},"geometry":{"type":"Point","coordinates":[23.9729984,42.8305933]}},{"type":"Feature","properties":{"pathName":"lopian",
    "gallery": [
        "Морена на мястото на къщата на Лалю Генов"
    ],"type":"village","content":"В къщата на Лалю Генов Васил Левски основава частен революционен комитет. Морена с паметна плоча, открита на 19.02.2007 г.","name":"Лопян"},"geometry":{"type":"Point","coordinates":[24.071796,42.88075]}},{"type":"Feature","properties":{"pathName":"pravets","gallery":[],"type":"town","content":"Дейността на създадения от Апостола комитет в Правец с председател Цвятко Вълков е представена в експозицията на Историческия музей в града. В Правец Апостола отсяда в Цвятковия (Чипилския) хан. Комитетът е заклет от поп Марко Тодоров, чиято къща е функционирала като музей до 1990 г. Бюст паметникът на Васил Левски пред ОУ „В. Левски“, скулптор Любомир Прахов, открит през 1987 г.","name":"Правец"},"geometry":{"type":"Point","coordinates":[23.915959332804075,42.89104579977614]}},{"type":"Feature","properties":{"pathName": "vidrare",
    "gallery": [
        "Бюстът на Апостола в центъра на Видраре",
        "Ханът на Вутьо Попиванов - Туняка",
        "Стела за къщата на поп Георги Тутмаников"
    ],"type":"village","content":"В селото Васил Левски е доведен от своя съученик, родом от Сопот, учителя Илия Гюндузов. Неговото уверение, че в селото живеят будни българи, се оказва вярно. По-късно седем души от комитета са заточени в Диарбекир. Бюст паметникът на Левски на централния площад, скулптор Крум Дерменджиев, открит през 1987 г. Встрани от пътя на края на селото се намира ханът на Вутьо Попиванов – Туняка, със скривалище в една от стаите под миндера и таен подземен тунел от мазето, извеждащ към хълма „Венеца“. Уредена е експозиция за дейността на Видрарския революционен комитет. Стела за къщата на поп Георги Тутмаников, където са отсядали Васил Левски и Димитър Общи. Той подпомага основаването и дейността на няколко комитета – във Видраре (където е свещеник и член на ЧРК), в Джурово (където е бил председател), в Лопян и др.","name":"Видраре"},"geometry":{"type":"Point","coordinates":[24.010409007373713,42.99298006233437]}},{"type":"Feature","properties":{"pathName":"samokov",
    "gallery": [
        "Манастир „Покров на Света Богородица“",
        "Паметна плоча в манастира"
    ],"type":"town","content":"Според предание Васил Левски пристига в Самоков през 1871 г., като отсяда в девическия манастир „Покров на Света Богородица“, за да създаде революционен комитет. Местните чорбаджии обаче не допускат това да се случи. Паметен знак на входа на манастира и паметна плоча от вътрешността.","name":"Самоков"},"geometry":{"type":"Point","coordinates":[23.55788299212071,42.33656109036554]}},{"type":"Feature","properties":{"pathName": "bunovo",
    "gallery": [
        "Мемориален комплекс „Васил Левски – кръстопът на апотолите“"
    ],"type":"village","content":"В селото работи активно революционният комитет, основан от Васил Левски. Председателят му Алипий Петков (Митю Пранов) е един от участниците във Великото народно събрание в Оборище през 1876 г. Мемориален комплекс „Васил Левски – кръстопът на апостолите“; скулптор Йордан Кръчмаров, открит през 2007 г. на около 3 км южно от Буново в близост до рида „Гълъбец“ в памет на дейността на Апостола в селото и целия регион.","name":"Буново"},"geometry":{"type":"Point","coordinates":[23.930876313621805,42.715973406746144]}},{"type":"Feature","properties":{"pathName":"koprivshtitsa",
    "gallery": [
        "Къща музей „Любен Каравелов“",
        "Църквата „Успение Богородично“"
    ],"type":"town","content":"Васил Левски посещава града в края на лятото на 1870 г., като се среща със съмишленици. През октомври следващата година е отново в Копривщица за обсъждане на проектоустава. В края на октомври 1872 г. се среща тук с близките на Любен Каравелов В експозицията на Къща музей „Любен Каравелов“ е отделено място за контактите му с Васил Левски. Църквата „Успение Богородично“, където се събира комитетът при архимандрит Кесарий и клисаря Никола Клисаров.","name":"Копривщица"},"geometry":{"type":"Point","coordinates":[24.360337246072348,42.633031969784426]}},{"type":"Feature","properties":{"pathName": "zlatitsa",
    "gallery": [
        "Златишкият метох",
        "Експозицията на Златишкия метох"
    ],"type":"town","content":"Според късни спомени първите стъпки за създаване на революционен комитет в града се отнасят към лятото на 1869 г. Документално установени са посещенията на Левски в Златица през 1870 г. и 1872 г. Апостола намира убежище в църковния метох в българската махала. Тодор Пеев адресира свое писмо до В. Левски в Златица. Съществуват спомени и за комитети в Пирдоп, Душанци, Мирково, Челопеч, Петрич, Смолско и др. Златишкият метох с барелеф на Васил Левски, скулптор Благовест Апостолов, открит през 2003 г. Има уредена експозиция за историята на метоха.","name":"Златица"},"geometry":{"type":"Point","coordinates":[24.139157162696808,42.71400235033569]}},{"type":"Feature","properties":{"pathName": "pernik",
    "gallery": [
        "Паметникът на Васил Левски в Перник"
    ],"type":"town","content":"Няма сигурни данни Вътрешната революционна организация, изградена от Апостола на свободата, да има дейност в този най-западен край на днешна България. Определени са Тодор Пеев и поп Георги Тутмаников да работят по тези места. Населението отдава своя поклон чрез издигането на паметници в Перник и Радомир. Паметник на Левски в централния парк на Перник; скулптор Георги Димитров, открит през 1971 г.","name":"Перник"},"geometry":{"type":"Point","coordinates":[23.037063515996905,42.60862191333985]}}, {"type":"Feature", "properties": {"pathName": "radomir", "gallery": [ "Паметникът на Васил Левски в Радомир"], "type": "town", "content": "Паметник на Апостола в Радомир пред общината, открит през 2007 г., скулптор Димитър Борисов. В непосредствена близост е изграден мраморен кът с „вечен огън“.", "name":"Радомир"}, "geometry":{"type":"Point","coordinates":[22.960739135742188, 42.54442961428346]}},{"type":"Feature","properties":{"pathName": "kustendil",
    "gallery": [
        "Паметникът на Васил Левски в Kюстендил"
    ],"type":"town","content":"Доказано е, че в този край мисия за изграждане на комитетска мрежа осъществява според даденото му от Левски пълномощно учителят от Етрополе Тодор Пеев. Каменна колона в Кюстендил пред общината, открита през 1998 г., скулптор Мите Чудомиров.","name":"Кюстендил"},"geometry":{"type":"Point","coordinates":[22.68748845642841,42.285398676995555]}},{"type":"Feature","properties":{"pathName": "dupnitsa",
    "gallery": [
        "Паметникът на Васил Левски в Дупница"
    ],"type":"town","content":"Бюст паметникът на Васил Левски пред стадиона в гр. Дупница, открит през 1951 г., скулптор Петър Балабанов.","name":"Дупница"},"geometry":{"type":"Point","coordinates":[23.112984840743973, 42.263113460340314]}},{"type":"Feature","properties":{"pathName": "blagoevgrad",
    "gallery": [
        "Паметниктът на Васил Левски в Блаогевград"
    ],"type":"town","content":"В Благоевград се намира бюст паметникът на Васил Левски пред ПГ „В. Левски“, скулптор Крум Дерменджиев, открит през 1998 г.","name":"Благоевград"},"geometry":{"type":"Point","coordinates":[23.092391698253074,42.016208707297885]}},{"type":"Feature","properties":{"pathName": "razlog",
    "gallery": [
        "Паметникът на Васил Левски в Разлог",
        "Къщата на Кипре Максев"
    ],"type":"town","content":"В приписките си свещеник Костадин Савов Чилев твърди, че В. Левски минал по земите около Пирин и основал революционен комитет в гр. Мехомия (Разлог). „Трябва да се помни от всички, че през лето на 1869 г. в Мехомия идва Апостола В. Левски и основа революционен комитет от 12 души в къщата на Кипре Максев.” Бюст паметник пред сградата на общината скулптор Михаил Шапкарев, открит през 1996 г. Къщата на Кипре Максев, ул. „Бяло море“ № 1.","name":"Разлог"},"geometry":{"type":"Point","coordinates":[23.460149102139212,41.886884437523804]}},{"type":"Feature","properties":{"pathName": "pazardzhik",
    "gallery": [
        "Паметна плоча на мястото на Ръжанковия хан",
        "Паметникът на Васил Левски в Пазарджик",
        "РИМ - Пазарджик, историята на комитетската организация",
        "Баткунския манастир"
    ],"type":"town","content":"Според спомени на пазарджишките ханджии братя Петкови Дякона нощува в хана им и се подстригва на път за Белград за участието си в Първата българска легия. Документално е установено, че по-късно той посещава града многократно. Председател на местния комитет е Георги Консулов. Апостола нощува в хановете на Михо Стефанов и Стоян Ангелов, на братя Никола и Иван Ръжанкови. В дома на Михо Стефанов се устройват комитетските събрания. Оттам Апостола поема последния си път към Ловеч, придружен до Троянския манастир от Никола Ръжанков. За съжаление времето не е пощадило местата, свидетели на тези бурни събития. Паметна плоча с барелеф на мястото на Ръжанковия хан, скулптор Недко Кръстев, ул. „Батак“ № 2. Паметникът на Васил Левски в централната градска част, открит през 1976 г., скулптор Величко Минеков. В Регионален исторически музей – Пазарджик е показана историята на комитетската организация в региона. Според спомени Левски посещава и Баткунския манастир, недалеч от Пазарджик, до с. Паталеница.","name":"Пазарджик"},"geometry":{"type":"Point","coordinates":[24.334747755853627,42.19281638997164]}},{"type":"Feature","properties":{"pathName": "strelcha",
    "gallery": [
        "Ханът на Неделю Сапунджиев",
        "Фигурална композиция за Апостола в Стрелча"
    ],"type":"town","content":"Спомените разказват, че Васил Левски посещава селото три-четири пъти. По време на втората си обиколка по българските земи през 1869 г. Левски се осведомява за положението в Стрелча от учителя Поликарп Чуклев и се осъществява среща с няколко души от селището в хана на Дело (Недельо) Сапунджиев. На 28 срещу 29 октомври 1871 г., вероятно в къщата на поп Бойчо Петров Хаджиев, са положени основите на революционния комитет. Една година по-късно, през декември 1872 г. по пътя си от Пазарджик за Сопот той минава през Стрелча за последен път. Ханът на Недельо Сапунджиев, където заседава комитетът, бул. „България“ № 70. Фигурална композиция в градския парк, открита през 1998 г., скулптор Величко Минеков","name":"Стрелча"},"geometry":{"type":"Point","coordinates":[24.32331713063627,42.50098617395968]}},{"type":"Feature","properties":{"pathName": "panagiurishte",
    "gallery": [
        "Църквата „Св. Георги“",
        "Духовниковата къща",
        "Карловското знаме",
        "Ескспозиция на ИМ - Панагюрище"
    ],"type":"town","content":"Местните изследователи установяват 4 или 5 посещения на Левски в града през периода от 1869 г. до октомври 1872 г. В Панагюрище Апостола отсяда в къщата на Найден Дринов, в Духовниковата къща, също и в Лековата, Каменската и Багряновата; посещава църквата „Св. Георги“. Дейни участници в комитета са Найден Дринов, Иван Дудеков, Георги Манев, Симеон Хаджикирилов и др. Духовниковата къща, където е заклет панагюрския революционен комитет. Експозиция в Тутевата къща, ул. „20 април“ № 8 – копие на Карловското знаме (шито от Мария Ганева в Карлово по поръка и модел на В. Левски), развято пред къщата при избухване на въстанието – прототип на знамето на Райна Княгиня. В Исторически музей – Панагюрище с вещи и снимки е показана дейността на Левски и комитетската организация в района.","name":"Панагюрище"},"geometry":{"type":"Point","coordinates":[24.188790144533755,42.49869778681207]}},{"type":"Feature","properties":{"pathName": "perushtitsa",
    "gallery": [
        "Дановото училище"
    ],"type":"town","content":"Васил Левски посещава Перущица по време на първите си две обиколки през 1869 г. Търси контакт с Петър Бонев – участник в Първата българска легия. Той е председател на комитета в града, създаден в Дановото училище. То е запазено и днес с възстановени учебни стаи от времето, когато в него е идвал Апостола.","name":"Перущица"},"geometry":{"type":"Point","coordinates":[24.54835972944378,42.05979694085897]}},{"type":"Feature","properties":{ "pathName": "plovdiv",
    "gallery": [
        "Къщата на д-р Рашко Петров",
        "Паметникът на Васил Левски до Бунарджика",
        "Паметна плоча на мястото на хана на братя Търневи"
    ],"type":"town","content":"Многократно и трайно е присъствието на града в житието на Апостола: от пребиваването в затвора през лятото на 1863 г. заради участието му в Първата българска легия, посещаването на училището на Йоаким Груев, до идванията му по време на революционните обиколки и създаването на революционния комитет в училището „Света Троица“, където живее избраният за председател учител Димитър Матевски. Богатият пловдивски търговец Душо Хаджидеков, член на комитета, многократно посреща Апостола в дюкяна си. Той отсяда и у друг виден пловдивчанин – д-р Рашко Петров. Ханът, намирал се на улицата, идваща откъм Карлово, служи за склад на оръжие, а стопаните – братята Христо и Георги Търневи, неведнъж са приютявали Апостола и други борци за свобода. Многократни са и контактите с руския вицеконсул Найден Геров. За жалост, твърде малко са запазените обекти в града, свързани с Апостола. Къщата на д-р Рашко Петров, ул. „Съборна“ № 23 – лекар на Първа българска легия, съдейства за освобождаването на Левски от пловдивския затвор през есента на 1863 г., подпомага освободителното движение. Паметникът на Васил Левски в подножието на хълма Бунарджика, открит през 1936 г., скулптор Иван Лазаров. Паметна плоча на мястото на хана на братя Търневи, кръстовището на ул. „Васил Левски“ и ул. „Братя Търневи“.","name":"Пловдив"},"geometry":{"type":"Point","coordinates":[24.75199802369057,42.14963165313221]}},{"type":"Feature","properties":{"pathName": "voinyagovo",
    "gallery": [
        "Училището, в което е преподавал Апостола",
        "Църквата „Св. Димитър“"
    ],"type":"village","content":"На 23 април (стар стил) 1864 г. – Гергьовден, разкалугерилият се йеродякон Игнатий става учител в селото и бързо спечелва любовта не само на учениците си, но и на по-будните младежи. По-късно основава и революционен комитет. Църквата „Св. Димитър“, построена през 1853 г., в която пее Васил Левски. В черковния двор е възстановено училището, в което той учителства през 1864-66 г., а през ранната пролет на 1865 г. основава първото „Тайно братство“ – прототип на по-късните революционни комитети.","name":"Войнягово"},"geometry":{"type":"Point","coordinates":[24.753654152408895,42.57571429435819]}},{"type":"Feature","properties":{"pathName": "dabene",
    "gallery": [
        "Храма „Св. Николай“",
        "Паметна плоча на поп Мина"
    ],"type":"village","content":"По време на пребиваването си във Войнягово Апостола дружи с учителите Лило Митев и Минчо Хаджинедев от съседното село Дъбене, по-късно свещеник. В особено критична ситуация по време на революционната си дейност В. Левски отсяда в дома на даскал Лило. Сред дъбенските съзаклятници е и Нено Ив. Ламбов. На храма „Свети Николай“ в село Дъбене е поставена през 2011 г. паметна плоча  на Минчо Хаджинедев (поп Мина Пищовлията, 1836 – 1876).","name":"Дъбене"},"geometry":{"type":"Point","coordinates":[24.766377497193325,42.59978513894402]}},{"type":"Feature","properties":{"pathName":"vasil_levski_selo", "gallery":[],"type":"village","content":"Най-вероятно Апостола нееднократно е преминавал и през това село, недалеч от Карлово по пътя за Калофер. Жителите на селото, носещо неговото име от 1934 г., отдават своята почит с изграждането на вълнуващ бюст паметник. Бюст паметникът на Васил Левски, скулптор Недко Кръстев, открит през 2007 г.","name":"Васил Левски"},"geometry":{"type":"Point","coordinates":[24.89444187948834,42.606045463125]}},{"type":"Feature","properties":{ "pathName": "sopot",
    "gallery": [
        "Манастирът „Св. Спас“",
        "Скривалището на Левски в Девическият метох в Сопот",
        "Паметникът на Васил Левски в Сопот"
    ],"type":"town","content":"Възрожденският Сопот има своето безспорно значение за регионалната и националната българска история. Още в самото начало на изграждането на ВРО Левски включва и Сопот. В града е създаден революционен комитет, в състава на който влизат едни от най-видните жители – Фратьо Попов, Никола Иванов, Сребри Стойновски, Тодор Кошников, Ганчо Поп Николов и др. Целият град е изпепелен през „Страшното“ – лятото на 1877 г.","name":"Сопот"},"geometry":{"type":"Point","coordinates":[24.756212175212834,42.658216744748415]}},{"type":"Feature","properties":{"pathName": "klisura",
    "gallery": [
        "Старата църква „Св. Николай“",
        "Параклисът „Св. Архангел Михаил“"
    ],"type":"town","content":"Според спомените на дякон Максим Пелов, по-късно Пловдивски митрополит, Апостола минава два пъти през Клисура по време на обиколките си. Заедно с Ангел Кънчев и Димитър Общи посещават града в началото на октомври 1871 г., когато вероятно е създаден и революционен комитет. Старата църква „Св. Николай“ и параклисът „Св. Архангел Михаил“, където Васил Левски отсяда при Максим Пелов.","name":"Клисура"},"geometry":{"type":"Point","coordinates":[24.45037745844117,42.6955434821658]}},{"type":"Feature","properties":{"pathName": "pesnopoi",
    "gallery": [
        "Морена с паметна плоча за срещата на Апостола с Иван Грозев"
    ],"type":"village","content":"Разположено на пътя Карлово – Пловдив, Апостола неведнъж минава през селото и го споменава в личния си бележник. Морена с паметна плоча, открита през 2017 г. на главната улица на селото за срещата на Васил Левски и Иван Грозев, описана от Иван Вазов в разказа „Чистият път“.","name":"Песнопой"},"geometry":{"type":"Point","coordinates":[24.80961785743959,42.48781563105458]}},{"type":"Feature","properties":{"pathName": "hisar",
    "gallery": [
        "Църквата „Св. Димитър“"
    ],"type":"town","content":"Неведнъж Апостола оставя Димитър Общи тук, докато обхожда комитетите в околните селища. Това твърди и Общи пред съда в София. Църквата „Св. Димитър“ в кв. „Веригово“, в която Левски събира местния революционен комитет.","name":"Хисаря"},"geometry":{"type":"Point","coordinates":[24.705696457299293,42.50610810636877]}},{"type":"Feature","properties":{"pathName": "svezhen",
    "gallery": [
        "Серафимовата къща"
    ],"type":"village","content":"Серафимовата къща със скривалище, в която Апостола основава ЧРК с председател учителя Гено Серафимов, убит през Страшното. Сега е къща музей на полк. Вл. Серафимов.","name":"Свежен"},"geometry":{"type":"Point","coordinates":[25.0262569868311,42.50726282959483]}},{"type":"Feature","properties":{"pathName": "brezovo",
    "gallery": [
        "Светското училище",
        "Църквата „Св. Димитър“"
    ],"type":"town","content":"Светското училище, създадено през 1837 г., в което е основан от Васил Левски частен революционен комитет през март 1872 г.  Църквата „Св. Димитър”, построена през 1843 г., в която е пял Апостола – паметна плоча.","name":"Брезово"},"geometry":{"type":"Point","coordinates":[25.079384157470106,42.34197411504555]}},{"type":"Feature","properties":{ "pathName": "rozovets",
    "gallery": [
        "Къщата на поп Никола Генчев"
    ],"type":"village","content":"Къщата на поп Никола Ганчев със скривалище на Васил Левски, в която той основава частен революционен комитет.","name":"Розовец"},"geometry":{"type":"Point","coordinates":[25.114331032844515,42.4641589278704]}},{"type":"Feature","properties":{"pathName": "trud",
    "gallery": [
        "Паметникът на Васил Левски в Труд"
    ],"type":"village","content":"Паметникът на Васил Левски пред параклиса „Успение Богородично“ до мястото на хана на Георги Салашев, където отсяда Апостола; скулптор Иван Тотев, открит през 2015 г.","name":"Труд"},"geometry":{"type":"Point","coordinates":[24.73016591480432,42.23471466024352]}},{"type":"Feature","properties":{"pathName": "tsaratsovo",
    "gallery": [
        "Паметна плоча за Апостла в Царацово"
    ],"type":"village","content":"Селото е споменато в личния бележник на Левски. Многократно той отсяда в къщата на своя верен помощник Иван Арабаджията, в къщата на Божил Георгиев, в местния хан. Паметна плоча на В. Левски на входа на читалищната сграда, поставена през 2012 г., скулптор Виктор Тодоров. Паметникът на Иван Арабаджията – верен сподвижник на Апостола; архитект Георги Караянев, скулптор Виктор Тодоров, 1973 г.","name":"Царацово"},"geometry":{"type":"Point","coordinates":[24.689003194904135,42.2033273124095]}},{"type":"Feature","properties":{"pathName": "asenovgrad",
    "gallery": [
        "Паметникът на Васил Левски в двора на ОДК „Васил Левски“",
        "Църквата „Св. Петка“",
        "Барелеф на Васил Левски при входа на църквата „Св. Петка“",
        "Араповският манастир",
        "Паметна пллоча на духовници сподвижници на Васил Левски до входа на Араповския манастир"
    ],"type":"town","content":"Градът и околните селища са сред тези, за които няма документални свидетелства за посещение на Апостола. Спомени на съвременници разказват за негово преминаване през града, за дейността му в околните села и манастири. В манастира „Света Петка“ (Мулдавска) основават комитет. Паметникът на Васил Левски в двора на ОДК „Васил Левски“, скулптор Рашо Митев, 2003 г. При входа на манастира „Света Петка“ през 2001 г. е поставен барелеф на Васил Левски, скулптор Петко Москов. Араповският манастир „Света великомъченица Неделя“ е мястото, където, според записките на Отон Иванов, той и други съмишленици са заклети от Апостола. Паметна плоча на духовници сподвижници на Васил Левски е поставена до входа на манастира през 1999 г.","name":"Асеновград"},"geometry":{"type":"Point","coordinates":[24.8762973036257,42.01182594169023]}},{"type":"Feature","properties":{"pathName": "stara_zagora",
    "gallery": [
        "Катедралният храм „Св. Димитър“",
        "Стенопис в храма „Св. Димитър“",
        "Хилендарският метох в двора на храма „Св. Димитър“",
        "Паметникът на Апостола в Стара Загора"
    ],"type":"town","content":"Като послушник на вуйчо си, Васил Иванов Кунчев пристига в града, учи две години в Светиниколското класно училище и завършва едногодишен курс за свещеници. При изграждането на ВРО Апостола посещава града още през лятото на 1869 г., през лятото и в края на октомври 1871 г. и след още една година. Председател на комитета е Кольо Ганчев. Тук Левски получава от отец Матей Преображенски две писма от Каравелов от 30 октомври и 2 ноември 1872 г. На 21 ноември свиква събрание за обсъждане на предложението на Каравелов за незабавно въстание. Катедралният храм „Св. Димитър“ и стенопис в него с изображението на Васил Иванов Кунчев като псалт, художници Н. Кожухаров и Д. Гюдженов, 1960 г. Хилендарският метох в двора на храма, в който живеят с вуйчо му през 1855-1858 г. Бюст паметник на Апостола е открит пред храма през 1976 г., скулптор Любомир Петков.","name":"Стара Загора"},"geometry":{"type":"Point","coordinates":[25.63106973000186,42.42881268875445]}},{"type":"Feature","properties":{ "pathName": "chirpan",
    "gallery": [
        "Къщата на Г. Данчов - Зографина"
    ],"type":"town","content":"Апостола пристига в града още през лятото на 1869 г. у Георги Данчов, през лятото и в края на октомври на 1871 г., когато нощува в местния хан. Той отразява в бележника си пребиваването си в Чирпан на 9 март 1872 г. и направените разноски. В края на октомври и след месец е отново в града. Двамата с Георги Данчов, чийто дом се превръща в средище на създадения революционен комитет, осъществяват обиколки и срещи в селата в Чирпанско и Новозагорско. Къщата на Георги Данчов – Зографина, музей до 1992 г. Паметникът на В. Левски пред Градската художествена галерия, открит през 2003 г., скулптор Иван Блажев","name":"Чирпан"},"geometry":{"type":"Point","coordinates":[25.32619375257336,42.20461967380969]}},{"type":"Feature","properties":{"pathName": "gabarevo",
    "gallery": [
        "Паметникът на Васил Левски в Гъбарево",
        "Джанановата къща с барелеф на Апостола",
        "Джанановта къща"
    ],"type":"village","content":"Още в началото на създаване на революционните комитети В. Левски идва в селото и се среща с местните революционери. Посещава го и две години по-късно. Създаденият комитет, начело с председателя Васил Джананов, е един от активните в района. Джанановата къща, уредена като музейна сбирка, с барелеф на Васил Левски на входа, скулптор Цветослав Христов. Област Стара Загора","name":"Габарево"},"geometry":{"type":"Point","coordinates":[25.16330023999005,42.62308474319362]}},{"type":"Feature","properties":{"pathName": "kazanlak",
    "gallery": [
        "Паметникът на Васил Левски в Казанлък",
        "Паметна плоча на мястото на хана на баба Гана",
        "Храм „Св. троица“",
        "Паметна плоча в храма „Св. троица“"
    ],"type":"town","content":"На път за Ст. Загора Апостола се запознава с Петко Ганин и нощува в хана на майка му. След разпускането на Първата легия на път за Карлово през пролетта на 1863 г., той остава в хана три дни и праща писмо до майка си да му изпроводи монашески дрехи. За трето посещение на Левски в града разказва в спомените си поп Георги Сеизов. През март и ноември 1872 г. Апостола е за последно в Казанлък Бюст паметникът на Апостола в квартал „Васил Левски“, открит през 2008 г., скулптор Велин Дечков. Барелеф и паметна плоча на мястото на хана на баба Гана, където Васил Левски основава революционния комитет; 1993 г., скулптор Леонид Мицев; бул. „23-ти пехотен шипченски полк” № 4. Историческо събитие за храма „Света троица“ е, че през месец февруари 1869 г. Апостолът на свободата йеродякон Игнатий – Васил Левски, е взел участие във вечерно богослужение. Поставена е паметна плоча, открита през 2008 г.","name":"Казанлък"},"geometry":{"type":"Point","coordinates":[25.392068483026893,42.62538877010873]}},{"type":"Feature","properties":{"pathName": "haskovo",
    "gallery": [
        "Паметникът на Васил Левски в Хасково",
        "Паметна плоча в ОУ „Св. Климент Охридски“"
    ],"type":"town","content":"За първото посещение на В. Левски в града разказва в спомените си Димитър Попстефанов. При второто му идване в началото на ноември 1872 г. полага основите на революционен комитет с участието на младите учители Петър Берковски (приятел на Левски още от Белград) и Стоян Заимов, Христо Златарев, Мирчо Попов и др. Бюст паметникът на Васил Левски, скулптор Иван Парасков, открит през 1987 г., пл. „Спартак“. Паметна плоча в ОУ „Св. Климент Охридски“.","name":"Хасково"},"geometry":{"type":"Point","coordinates":[25.555629871480686,41.93631136175561]}},{"type":"Feature","properties":{"pathName": "harmanli",
    "gallery": [
        "Паметникът на Васил Левски в Хамранли"
    ],"type":"town","content":"Повечето от селищата в района са турски и това прави пътя на Апостола през тях особено опасен. Въпреки това, според спомените той се среща с даскал Делчо Милковски, от когото разбира, че тук няма условия за създаване на комитети. Бюст паметникът на Васил Левски, скулптор Цветослав Христов, открит през 2003 г., пл. „Възраждане“.","name":"Харманли"},"geometry":{"type":"Point","coordinates":[25.9067549344124,41.92736179504563]}},{"type":"Feature","properties":{"pathName": "svilengrad",
    "gallery": [
        "Паметна плоча за къщата на Димитраки Бояджиолу"
    ],"type":"town","content":"Жителите на града отдавна се вълнуват от идеята за свобода. Сред първенците са учителят Стоян поп Марков, Станко Разбойников, Димитър Новаков, чорбаджията Димитраки Бояджиолу, в чийто дом и хан е основан революционният комитет. Паметна плоча на мястото, където е бил домът на Димитраки Бояджиолу, ул. „Христо Ботев“ № 11. Бюст паметник на Васил Левски, открит през 2011 г., Тора арт – Тодор Ганарев, кръстовище на ул. „Гео Милев“ и ул. „Д. Благоев“.","name":"Свиленград"},"geometry":{"type":"Point","coordinates":[26.204256417191687,41.76418847031844]}},{"type":"Feature","properties":{"pathName": "yabalkovo",
    "gallery": [
        "Паметникът на Васил Левски в Ябълково",
        "Паметна плоча на мястото на Славянския дом"
    ],"type":"town","content":"Разположено на трасето на строящата се Баронхиршова железница, селото е посещавано от В. Левски няколко пъти. Създаден е революционен комитет с председател Димитър Ралов. В работата му се включват освен местни хора и стануващите в селото чешки и полски инженери Иржи Прошек, Антонин Пелц, Станислав Домбровски. Те организират превозване на оръжие за организацията по железницата. Ползващият се с консулски имунитет Славянски дом е безопасно място за дейността на комитета. Паметна плоча на мястото на Славянския дом, където Левски създава революционния комитет, автор Михаил Георгиев, 2013 г.","name":"Ябълково"},"geometry":{"type":"Point","coordinates":[25.44168696359829,42.07069760869128]}},{"type":"Feature","properties":{"pathName":"smolian","gallery":["Бюст паметник на Райковската гимназия"],"type":"town","content":"Няма документални свидетелства Апостола да е стигнал в организационните си обиколки до днешната Смолянска област. Само в спомени се разказва, че към 1870 г. Стойо Боботанов приема Левски в дома си в Райково или за посещения в други родопски села. Жителите на Смолян традиционно отдават почит към Апостола в двора на Райковската гимназия, където има бюст паметник от 2004 г., скулптор Росица Мишева.","name":"Смолян"},"geometry":{"type":"Point","coordinates":[24.70319709397015,41.58047102356115]}},{"type":"Feature","properties":{"pathName":"malevo","gallery":["Бюст паметник на Васил Левски в Малево"],"type":"village","content":"В село Малево, Смолянско, също има бюст паметник на Апостола на свободата","name":"Малево"},"geometry":{"type":"Point","coordinates":[24.656242531296026, 41.86471766904466]}},{"type":"Feature","properties":{"pathName": "kardzhali",
    "gallery": [
        "Паметникът на Васил Левски в Кърджали"
    ],"type":"town","content":"И в тази област, въпреки че Апостола не е посещавал места в нея, жителите ѝ проявяват отношението си към Апостола на свободата с изграждане на паметници и паметни знаци. Училища, читалища и други организации носят неговото име. В Кърджали паметникът на Васил Левски е изграден на централния площад пред сградата на общината през 2003 г., скулптор е Константин Денев.","name":"Кърджали"},"geometry":{"type":"Point","coordinates":[25.3684109401988,41.647298173638724]}},{"type":"Feature","properties":{"pathName":"krumovgrad","gallery":["Паметникът на Васил Левски в Крумовград"],"type":"town","content":"Бюст паметник на Апостола на свободата е поставен и в двора на СУ „Васил Левски“ в Крумовград.","name":"Крумовград"},"geometry":{"type":"Point","coordinates":[25.65499878139235, 41.471634157873794]}}, {"type":"Feature","properties":{"pathName": "sliven",
    "gallery": [
        "Паметникът на Васил Левски в Сливен"
    ],"type":"town","content":"На 2 ноември 1871 г. В. Левски се настанява в местен хан за 3-4 дена и организира събрание, раздава „книжата“ на местните дейци. Сред тях са Михаил Греков, Атанас Узунов, Таню Ст. Куртев. Отново е в града на 14-15 март 1872 г., което отбелязва в бележника си. Води активна кореспонденция с местния комитет. През ноември е отново в града за обсъждане на въпроса за незабавно вдигане на революцията, поставен в последните писма на Л. Каравелов. Бюст паметникът на Васил Левски в градината в кв. Клуцохор, открит през 2007 г., скулптор Красимир Ангелов.","name":"Сливен"},"geometry":{"type":"Point","coordinates":[26.316481308348845,42.68448488322496]}},{"type":"Feature","properties":{"pathName": "nova_zagora",
    "gallery": [
        "Паметникът на Васил Левски в Нова Загора"
    ],"type":"town","content":"Апостола посещава града през лятото на 1869 г., като отсяда в къщата на поп Георги Караминков и полага основите на съзаклятието. Председател е Дидьо Сивков. През пролетта и есента на 1871 г. В. Левски отново е в Нова Загора, като нощува в Сивковия хан. Бюст паметникът на Васил Левски, открит през 2014 г., скулптор Йордан Гаврилов, пл. „Свобода”.","name":"Нова Загора"},"geometry":{"type":"Point","coordinates":[26.006868264806965,42.492118866016476]}},{"type":"Feature","properties":{"pathName": "kotel",
    "gallery": [
        "Паметна плоча на мястото, където е създаден местния комитет"
    ],"type":"town","content":"В началото на ноември 1871 г. Васил Левски, Димитър Общи и Ангел Кънчев посещават Котел, а оттам поемат към с. Беброво, Елена и Търново. Първите котленци, с които Васил Левски се свързва, са сестрите на Г. Раковски – Неша и Нанка. Димчо Великов (книговезецът), поп Янко и Тодор Станчев, влизат в състава на революционния комитет. Поп Янко Икономов, Димчо Великов, Божил Райнов оставят спомени за Апостола в Котел. Паметна плоча на мястото, където е създаден от Васил Левски котленския революционен комитет.","name":"Котел"},"geometry":{"type":"Point","coordinates":[26.444925750697198,42.8905731606028]}},{"type":"Feature","properties":{"pathName": "yambol",
    "gallery": [
        "Паметникът на Васил Левски в Ямбол"
    ],"type":"town","content":"Барелеф на Васил Левски до централния вход на ПГ „Васил Левски“, открит през 1989 г., скулптор Петър Желев.","name":"Ямбол"},"geometry":{"type":"Point","coordinates":[26.510289727950525,42.48570169410405]}},{"type":"Feature","properties":{"pathName": "burgas",
    "gallery": [
        "Паметникът на Васил Левски в Бургас"
    ],"type":"town","content":"Макар и без исторически документ, съществува убеждението, че Васил Левски преминава през Бургас. Бюст паметникът на Васил Левски в Морската градина, открит през 1936 г., скулптор Васил Киров.","name":"Бургас"},"geometry":{"type":"Point","coordinates":[27.465749886875795,42.50838441239622]}},{"type":"Feature","properties":{"pathName":"aitos","gallery":[],"type":"town","content":"Съпругата на свещеник Апостол Дяков Димов – Яна, си спомня гостуването на Левски в в Айтос и участието му в църковна служба. Провежда събрание, на което събира значителна сума за организацията, но не успява да създаде комитет поради силното влияние на фанариотите в града. Барелеф и паметна плоча на Васил Левски на фасадата на църквата „Свети Димитър Солунски“, открити през 1997 г., скулптор Христо Танев.","name":"Айтос"},"geometry":{"type":"Point","coordinates":[27.25327242774489,42.70451857342273]}},{"type":"Feature","properties":{"pathName": "karnobat",
    "gallery": [
        "Къщата на Минко Неволин"
    ],"type":"town","content":"Васил Левски два пъти посещава града и нощува у Киро Великов Драндаря. Второто посещение на Апостола е пряко свързано с подготовката за създаване на комитет. Къщата на Минко Неволин, където се укрива Левски, днес е административна сграда на Историческия музей.","name":"Карнобат"},"geometry":{"type":"Point","coordinates":[26.978479641069505,42.64655404071055]}},{"type":"Feature","properties":{"pathName": "vidin",
    "gallery": [
        "Паметникът на Апостола във Видин"
    ],"type":"town","content":"В най-северозападната област на днешна България Васил Левски не изгражда комитетска мрежа. Няма категорични данни по време на своите обиколки той да е посещавал този регион с организационна мисия. Васил Левски минава през Видинския край и посещава някои селища, което оставя спомени в жителите им, през 1868 г. През май Левски напуска Белград и заминава за Влашко. През юни се завръща в Сърбия, арестуван е и прекарва известно време в затвора в Зайчар. След освобождаването му от там той се отправя отново към Румъния и вероятно отново минава през Видинско. В този район през 30-50-те години на XIX в. населението се вдига многократно на бунтове, потушавани жестоко от османските власти, които поддържат там и агентурен апарат. Вероятно това дава своето отражение върху жителите на селищата, а също и на преценката на В. Левски за организационната му работа там лично. Признанието и паметта на хората към Апостола е изразено чрез няколко паметни знака – във Видин, Оряхово, Брегово, Кула, Белоградчик. Паметникът на Апостола във Видин, 1938 г., скулптор Димитър Бучински, ул. „Васил Левски“ № 2.","name":"Видин"},"geometry":{"type":"Point","coordinates":[22.868759452050664,43.99308965447122]}},{"type":"Feature","properties":{"pathName": "bregovo",
    "gallery": [
        "Паметна плоча в двора на църквата „Успение Богородично“"
    ],"type":"town","content":"През 2016 г. до входа на църквата „Успение Богородично“ е поставена паметна плоча с изображение на Левски и надпис, че Апостола е посетил Брегово през зимата на 1872 г. и създал комитет. Основанието на създателите е спомен за евангелие в църквата с приписка от самия Левски.","name":"Брегово"},"geometry":{"type":"Point","coordinates":[22.640720280256843,44.147459579689276]}},{"type":"Feature","properties":{"pathName": "montana",
    "gallery": [
        "Паметникът на Апостола в Монтана"
    ],"type":"town","content":"Селищата от Монтанския край остават встрани от обиколките на Васил Левски и пътищата, познали стъпките му. Оскъдни са сведенията за дейността на Апостола в този район. С нея е свързан гр. Лом. В спомени на негови съвременници се разказва и за посещение на Левски в Берковица, но не са запазени документални свидетелства. Със сигурност се знае, че Левски минава през Берковския балкан през 1867 г. с четата на Панайот Хитов. Паметникът на Апостола в Монтана до Централната градска градина, 2003 г., скулптор Михаил Шапкарев.","name":"Монтана"},"geometry":{"type":"Point","coordinates":[23.228328218588242,43.41723773920099]}},{"type":"Feature","properties":{"pathName": "lom",
    "gallery": [
        "Паметна плоча на пл. „Свобода“"
    ],"type":"town","content":"Според спомени на съвременици през Лом минава един от нелегалните пътища за дейците на БРЦК от Влашко към българските земи. От писмо на Левски до Данаил Хр. Попов се разбира, че от Лом са изпращани важни комитетски документи към българите в Пирот и околията. Според Тодор Пеев, участник в Общото събрание в Букурещ през 1872 г., той основава частен комитет в Лом с помощта на братя Ангелови. Паметна плоча на пл. „Свобода“ сочи мястото, където през 1872 г. при посещение в града Васил Левски се среща със съратника си и таен куриер Христо Савчов.","name":"Лом"},"geometry":{"type":"Point","coordinates":[23.233575441744424,43.83144880836402]}},{"type":"Feature","properties":{"pathName": "vratsa",
    "gallery": [
        "Църквта „Свето Възнесение“",
        "Каменен барелеф на Апостола в центъра на Враца",
        "Паметник на площад „Васил Левски“"
    ],"type":"town","content":"На 10 юли 1872 г. врачани сами полагат основите на революционната организация в града, като предварително са им изпратени екземпляри от Устава. Те пишат до Апостола и изразяват своята готовност за работа по народното дело. Левски им обещава, че той или упълномощено от него лице ще ги посети. Това се случва на 28 август 1872 г., когато той посещава Враца. Кръстьо Новкиришки, Мито Анков, Мито Цветков са ръководители на комитета във Враца. Има спомени, че посещава и църквата „Свето Възнесение“, днес част от Етнографско-възрожденския комплекс „Св. Софроний Врачански“. В Регионалния исторически музей – Враца, Васил Левски е представен наред с други видни възрожденци. Спомени разказват за посещения на Левски във Врачанско в селата Караш, Струпец и Струпешкия манастир, Курново, Старо село, Царевец, Долна Кремена и Лик и др. Каменен барелеф на Апостола на Свободата в центъра на Враца, 1995 г., скулптор Георги Тишков. Бюст паметник на площад „Васил Левски“.","name":"Враца"},"geometry":{"type":"Point","coordinates":[23.550881608870117,43.21410447885322]}},{"type":"Feature","properties":{"pathName": "mezdra",
    "gallery": [
        "Бюст паметник на Апостола в Мездра"
    ],"type":"town","content":"Бюст паметник на Левски в двора на ОУ „Христо Ботев“, 2015 г., скулптор Любомир Добрев.","name":"Мездра"},"geometry":{"type":"Point","coordinates":[23.714527035805876,43.145845694594]}},{"type":"Feature","properties":{"pathName": "lik",
    "gallery": [
        "Къщата на Нецо Гергов Бояджията"
    ],"type":"village","content":"В с. Лик, Община Мездра, е запазена къщата на Нецо Гергов Бояджията, поддържана от потомците му, с паметна плоча за среща на Апостола с местния комитет.","name":"Лик"},"geometry":{"type":"Point","coordinates":[23.762397372648184, 43.09233197990007]}},{"type":"Feature","properties":{ "pathName": "oriahovo",
    "gallery": [
        "Паметникът на Васил Левски в Оряхово"
    ],"type":"town","content":"През 1872 г. тук е назначен за учител верният сподвижник на Апостола – Сребрьо Стойновски. Идването му в Оряхово се свързва с укрепване на местния революционен комитет и изграждане на нелегален канал за връзка с Централния комитет в Букурещ и преминаването на революционни дейци от България в Румъния и обратно. Паметна плоча е поставена на къщата на братя Лулчеви, в която са ставали събранията на комитета. В нея е отсядал В. Левски през 1872 г. на път за Общото събрание в Букурещ и на връщане отсам Дунав. Паметник на Васил Левски до Детски комплекс в Оряхово, 2005 г., Пламен Петков.","name":"Оряхово"},"geometry":{"type":"Point","coordinates":[23.960633489948634,43.73956829863645]}},{"type":"Feature","properties":{"pathName": "pleven",
    "gallery": [
        "Паметникът на Апостола в Плевен",
        "Паметна плоча на мястото на къщата на Ан. Попхинов",
        "Експозиция за Апостола в РИМ - Плевен"
    ],"type":"town","content":"Писмо на Тодор Ковачов до Панайот Хитов дава информация, че Левски е минал през Плевен на 6 май 1869 г., като тогава взема от Анастас Попхинов отпечатаните прокламации на турски език на „Привременното правителство в Балкана“. По-късно той е един от учредителите на комитета в града, създаден от Апостола. Паметникът на Левски е в централната част на града пред зала „Катя Попова“, открит през 1985 г., дело на Владимир Гиновски. На мястото, където е била къщата на Анастас Попхинов, е поставена паметна плоча, ул. „Иван Мендиликов“ № 2. В Регионален исторически музей – Плевен, специална част от експозицията е посветена на Васил Левски и комитета в града.","name":"Плевен"},"geometry":{"type":"Point","coordinates":[24.614562123522912,43.42048901106939]}},{"type":"Feature","properties":{"pathName": "nikopol",
    "gallery": [
        "Смоляновата къща – къща музей „Васил Левски“",
        "Паметникът на В. Левски в Никопол"
    ],"type":"town","content":"За първи път Левски посещава Никопол в края на първата си обиколка по българските земи – преди 24 февруари 1869 г. По-късно често минава през града на път за Влашко. Според твърдения на негови съвременници от Никопол Левски не е основал комитетска организация там, а е разчитал на една предана група патриоти, посветени в революционното дело. Обикновено отсяда в къщите на Николчо Симеонов, Цвятко Смолянов и в хана на Коста Хинков в българската махала. Смоляновата къща – къща музей „Васил Левски“, в която се е укривал Апостола е реставрирана през 1968 г. Днес тя е етнографски музей, ул. „Васил Левски“ № 26. Бюст паметник на Апостола в центъра на Никопол.","name":"Никопол"},"geometry":{"type":"Point","coordinates":[24.89730330696426,43.70141204419245]}},{"type":"Feature","properties":{"pathName": "levski",
    "gallery": [
        "Паметникът на Апостола в гр. Левски"
    ],"type":"town","content":"Това е българският град, който носи името на Апостола. В парка пред гарата през 1976 г. е издигнат паметник на Левски. Автор е Рилчо Илиев.","name":"Левски"},"geometry":{"type":"Point","coordinates":[25.14338338718789,43.35917717902048]}},{"type":"Feature","properties":{"pathName": "lovech",
    "gallery": [
        "Старият квартал „Вароша“",
        "Музей „Васил Левски“",
        "Експозицията на Музей „Васил Левски“",
        "Лични вещи на Апостола в Музей „Васил Левски“",
        "Паметникът на Апостола в Ловеч"
    ],"type":"town","content":"Васил Левски основава един от първите революционни комитети в българските земи в града. Старият квартал „Вароша“ съхранява спомена за Апостола. Тук се намира Музей „Васил Левски“ – част от Регионален исторически музей (РИМ) – Ловеч. Сградата е построена на мястото, където се е намирала къщата на свещеник Лукан Лилов, в която е създаден Ловчанският революционен комитет. На 17 юли 1967 г. в него тържествено е открита нова експозиция. Догогава музеят се намира в къщата на Иван Крачула (баща на Христо Иванов-Големия) в кв. „Дръстене“, открит на 19 февруари 1954 г. Музеят притежава една от най-богатите колекции от лични вещи на Апостола и неговите сподвижници. Заради географското положение на града и верните съратници, които Апостола намира тук – Иван Драсов, Марин поп Луканов, Димитър Пъшков, Мария Сиркова, Никола Цветков и др., той решава именно в Ловеч да бъде и Централния комитет, който да има ръководна роля в организационната комитетска дейност по нашите земи. Левски често пребивава в Ловеч, води кореспонденция и организира дейността в Българско. Градът е свързан и с последното пътуване на Апостола от Южна България към Влашко през декември 1872 г. преди залавянето му в Къкринското ханче. Паметник на Васил Левски в Ловеч, издигнат над квартал „Вароша“, открит на 27 май 1964 г. – бронзова фигура висока девет метра върху масивен гранитен постамент. Колектив скулптори: Георги Гергов, Илия Илиев, Иван Кесяков.","name":"Ловеч"},"geometry":{"type":"Point","coordinates":[24.71185647713839,43.13938709718972]}},{"type":"Feature","properties":{"pathName": "kakrina",
    "gallery": [
        "Къкринското ханче",
        "Брястът – „единственият жив свидетел“ на „Къкринската Голгота“"
    ],"type":"village","content":"Това е мястото, където Апостола е заловен от османската власт на 27 декември 1873 г. Възстановеното Къкринско ханче е открито на 10 май 1931 г. като музей. То е първият музей, посветен на Васил Левски. Част е от РИМ – Ловеч. Там се намира и прекършеният от буря на 17 февруари 1997 г. бряст – „единственият жив свидетел“ на „Къкринската Голгота“, изправен и укрепен в метална конструкция с формата на арка. Пътят на Васил Левски от Ловеч до Къкрина е маркиран през 1968 г. По него всяка година на 19 февруари се провежда поход „По пътя на Левски“.","name":"Къкрина"},"geometry":{"type":"Point","coordinates":[24.884451738720625,43.12478669032355]}},{"type":"Feature","properties":{"pathName": "goliam_izvor",
    "gallery": [
        "Къща музей „Васил Левски“ (ханът на Георги Стойков)",
        "Барелеф на Апостола в с. Голям Изовр",
        "Експозиция за Левски в музея в Голям извор",
        "Възпоменателен знак в памет на заточениците в Диарбекир"
    ],"type":"village","content":"Революционният комитет в Голям Извор е от най-активните, многобройни и дейни комитети в структурата на ВРО. Сам Апостола има голямо доверие на дейците му – първия председател Марин Попдимитров, а след него кмета на селото и председател Димитър Крачунов – Стамболията, Георги Стойков, Васил Бушаранов и др. Основан от Левски, той е провъзгласен през 1872 г. за Окръжен комитет, като става център на първия революционен окръг в Българско, а в околностите се създава гъста мрежа от частни комитети. Паметна плоча, която отбелязва това събитие е поставена на къщата музей „Васил Левски“ (ханът на Георги Стойков) в с. Голям Извор. Поставен е и барелеф с лика на Апостола. В музея е представена експозиция, свързана с дейността на Левски в този регион. През 2007 г. до къщата музей е открит възпоменателен знак в памет на заточените в Диарбекир дейци от Голям извор след Арабаконашкия обир, автор Александър Стефанов.","name":"Голям извор"},"geometry":{"type":"Point","coordinates":[24.105900022011564,42.95760332546152]}},{"type":"Feature","properties":{"pathName": "teteven",
    "gallery": [
        "Хаджиивановата къща",
        "Част от експозицията на Хаджиивановата къща",
        "Храма „Св. Всех Святих“",
        "Паметна плоча на мястото на училището, където е основан комитета"
    ],"type":"town","content":"През втората половина на 1870 г. и тетевенци приобщават своите усилия към освободителното дело. Стоян Заимов описва интригуващо първото посещение на Апостола в Тетевен – как преоблечен като богат търговец на едър добитък от Влашко, Левски се запознава с тетевенските чорбаджии, а дори и с мюдюрина и кадията в конака. След като разкрива истинската си самоличност на местните български първенци, те с възторг приемат идеите за организиране на тайни комитети. Хаджиивановата къща, ул. „Симеон Куманов“ № 46, в която са провеждани заседания на Тетевенския революционен комитет. В него участват едни от най-заможните жители на Тетевен – Станьо Врабевски, Петко Милев Страшния, Станьо и Станчо Хаджииванови, Иван Фурнаджиев и др. Многократно е посещавана от Васил Левски и Димитър Общи. Поставена е възпоменателна плоча в памет на Станьо и Станчо Хаджииванови, членове на местния комитет, а по късно и заточеници в Диарбекир. Хаджиивановата къща е частна експозиция. Намира се в централната част на Тетевен, срещу църквата „Св. Всях Светих“. В нея могат да се видят вещи, документи и предмети на двата известни тетевенски възрожденски рода – на Хаджи Иван и Михал Койчев. На една от стените на храма „Св. Всех Святих“ в Тетевен е поставена паметна плоча за мястото, където се е намирало училището в двора на църквата, в което е основан и местният революционен комитет.","name":"Тетевен"},"geometry":{"type":"Point","coordinates":[24.260738166187878,42.92101537881177]}},{"type":"Feature","properties":{"pathName": "troian",
    "gallery": [
        "Музеят на занаятите",
        "Експозиция „Възраждане“",
        "Макет на ханa на Васил Спасов"
    ],"type":"town","content":"На 8 октомври 1871 г. в Троян Васил Левски, Димитър Общи и Ангел Кънчев създават местния революционен комитет. Апостола много пъти е пътувал от Ловеч през града и Троянския проход или по преките пътеки от връх Амбарица към Карлово. В Музея на занаятите – експозиция „Възраждане“, е представена революционната дейност в града, а централно място заемат макетите на някои емблематични за Троян сгради от Възраждането, между които и ханът на Васил Спасов, в който е създаден Троянският комитет.","name":"Троян"},"geometry":{"type":"Point","coordinates":[24.71072501323302,42.8849152625211]}},{"type":"Feature","properties":{"pathName": "lukovit",
    "gallery": [
        "Паметна плоча на къщата на Витко Лалев Йончев",
        "Мястото на хана, в който Левски е пренощувал при конвоирането му към София",
        "Паметникът на Васил Левски в Луковит"
    ],"type":"town","content":"Левски няколко пъти е посещавал и пренощувал в Луковит, съдейки и по тефтерчето му. Паметна плоча на къщата, в която е живял оръжейникът Витко Лалев Йончев. Паметната плоча в центъра на града на мястото на хана, в който Левски е пренощувал при конвоирането му за София през 1872 г. Паметник на Левски в Луковит, 2017 г., скулптор Цветослав Христов.","name":"Луковит"},"geometry":{"type":"Point","coordinates":[24.161055723483962,43.20940804581709]}},{"type":"Feature","properties":{"pathName": "gabrovo",
    "gallery": [
        "Паметна плоча на мястото на Девическия манастир „Свето Благовещение“",
        "РИМ - Габрово"
    ],"type":"town","content":"Изследователите установяват 4 или 5 посещения на Левски в Габрово. Придружен от Матей Преображенски, при третото си идване в Габрово, Левски полага основите на частен революционен комитет. През 1872 г. Апостола отново минава през Габровския район по пътя си от Казанлък към Ловеч. Престоя в Габрово той отбелязва в тефтерчето си, записва направените разходи – 2 гроша. Паметната плоча в градската градина е поставена през 1993 г. на мястото, на което се е намирал Девическият манастир „Свето Благовещение“, в който Левски е намирал убежище. В Регионалния исторически музей – Габрово се съхранява джобно ножче, за което се твърди, че е принадлежало на Левски.","name":"Габрово"},"geometry":{"type":"Point","coordinates":[25.31794614037152,42.87819896550251]}},{"type":"Feature","properties":{"pathName": "sevlievo",
    "gallery": [
        "Паметникът на Апостола в двора на СУ „Васил Левски“"
    ],"type":"town","content":"Левски за пръв път посещава града като организатор на комитетската мрежа. Идва в Севлиево и с помощниците си Ангел Кънчев и Димитър Общи. Повечето изследователи смятат, че Апостола създава местен революционен комитет. Според Иван Драсов, д-р Стойчо Христов е лицето, с което се поддържа връзка в Севлиево. Бюст паметник на Апостола се намира в двора на СУ „Васил Левски“. Скулптор е Людмил Блажев. Открит е през 2007 г.","name":"Севлиево"},"geometry":{"type":"Point","coordinates":[25.099901051589942,43.02437557046705]}},{"type":"Feature","properties":{"pathName": "drianovo",
    "gallery": [
        "Дряновски манастир",
        "Паметна плоча за Апостола",
        "Паметникът на Васил Левски в Дряново"
    ],"type":"town","content":"Още при Първата си обиколка из поробеното отечество през 1869 г. Васил Левски се отбива в Дряново и Дряновския манастир „Св. Архангел Михаил”. Тук той има среща със своя верен сподвижник отец Матей Преображенски – Миткалото. През пролетта на 1871 г., когато отново минава през градеца и манастира, е създаден революционният комитет в Дряново. Паметна плоча в Дряновския манастир отбелязва едно от идванията на Апостола в манастира. През 2006 г. до часовниковата кула в Дряново е поставен бюст паметник на Левски. Скулптор е Росица Мишева.","name":"Дряново"},"geometry":{"type":"Point","coordinates":[25.471909770168764,42.9718312337947]}},{"type":"Feature","properties":{"pathName": "triavna",
    "gallery": [
        "Къщата на Ангел Кънчев",
        "Попангеловата къща",
        "Паметна плоча за Апостола"
    ],"type":"town","content":"Предполага се, че първото посещение на Левски в Трявна е през 1869 г. Именно тогава се полагат основите на революционната организация в града, а самият комитет е конституиран посещава за втори път града (според Цаньо Захариев – трети). Къщата музей „Ангел Кънчев е строена в началото на ХІХ век. Роден дом на Ангел Кънчев – сподвижник и верен помощник на Васил Левски при изграждането на вътрешната революционна организация. Експозицията в нея представя и участието на тревненци в национално-освободителните борби през Възраждането. Къщата на поп Ангел (Попангеловата къща), ул. „Иванка Горова“ № 6, приютявала Васил Левски, когато той е идвал в Трявна по комитетски дела. Предполага се, че тя е построена в началото на 18 век и е най-старият архитектурен паметник в града. В нея е отсядал и революционерът Ангел Кънчев, родом от Трявна. Къщата е изцяло реставрирана и превърната в „Център на художествени занаяти“. На фасадата са поставени барелеф на Апостола и плоча, отбелязваща идването му.","name":"Трявна"},"geometry":{"type":"Point","coordinates":[25.492675687528788,42.86580419167972]}},{"type":"Feature","properties":{ "pathName": "veliko_tarnovo",
    "gallery": [
        "Музей „Възраждане и Учредително събрание“",
        "Зала „Васил Левски и ВРО“",
        "Зала „Васил Левски и ВРО“",
        "Зала „Васил Левски и ВРО“",
        "Музей „Затвор“",
        "Килията, в която Апостола престоява преди отвеждането му в София",
        "Паметна плоча на мястото на хана Бяла Бона",
        "Храмът „Св. Никола“",
        "Паметникът на Васил Левски на главната улица на Велико Търново",
        "Паметникът на Васил Левски в НВУ „Васил Левски“"
    ],"type":"town","content":"По спомени на Христо Иванов-Големия комитетът в Търново се създава през 1870 г. Според него Левски идва тогава за първи път в града и остава 3-4 дни и разговарят „за всичко подробно за навсякъде по България”. В сградата на днешния Музей „Възраждане и Учредително събрание“ – част от РИМ – В. Търново, тогава турски конак, са проведени двата разпита на Левски след залавянето му в Къкринското ханче. Той е разпитван от търновския окръжен управител в присъствието на целия градски съвет. Тук е установена и неговата самоличност. В специално обособената зала „Васил Левски и Вътрешната революционна организация” днес посетителите могат да видят дяконския орар (пояс) на Апостола, двата печата, поръчани от него за нуждите на Вътрешната революционна организация, оригинален портрет на Левски от 1870 г., лични вещи, снимки и документи на други комитетски дейци и съратници на Левски от Търновския край. Единственият в България музей „Затвор“ е в непосредствена близост до музей „Възраждане и Учредително събрание”. В приземния му етаж се намира килията, в която Апостола престоява тук преди отвеждането му към София за съдебния процес. Ханът на Бяла Бона – едно от тайните скривалища на Васил Левски се е намирал на днешната улица „Стефан Стамболов”, точно срещу паметника на известния политик и революционен деец. В наши дни на неговото място е построена нова сграда с паметна плоча на фасадата, напомняща за старата постройка. Храмът „Св. Никола“, действащ и днес, се намира в стария квартал Вароша. Там през 1870 г. е доведен Васил Левски, за което споменава Христо Иванов-Големия. Паметникът на Васил Левски, открит през 1946 г., се издига на главната улица, носеща неговото име. Инициатор е чехът Карл Йозеф Папоушек. Скулптурата е дело на Любомир Далчев. Не случайно изправената фигура на Васил Левски със завързани ръце и примка на шията е поставена на улицата, по която той минава за последен път рано сутринта на 29 декември 1872 г., конвоиран от турска стража на път за София. В основата на паметника е и забележителната му мисъл: „Ако печеля – печели цял народ, ако загубя – губя само себе си“. Паметник в НВУ „Васил Левски“, 1979 г., скулптор Владимир Гиновски.","name":"Велико Търново"},"geometry":{"type":"Point","coordinates":[25.626761546161074,43.076185710178166]}},{"type":"Feature","properties":{"pathName": "gorna_oriahovitsa",
    "gallery": [
        "Исторически музей - Горна Оряховица",
        "Паметникът на Васил Левски в Горна Оряховица"
    ],"type":"town","content":"Според мемоарите на Стоян Заимов Васил Левски посещава Горна Оряховица през 1869 г. и се среща с изявени местни дейци, сред които Петър Арнаудов и братята Велчо (Вичо) и Сидер Грънчарови. Не е известно кога точно е създаден комитет в селището. Вероятно това става при следващо посещение на Апостола в градчето, през 1871 г., когато е придружен от Ангел Кънчев и Димитър Общи. Като пристигат в града свикват местните комитетски дейци и обсъждат редица важни въпроси, свързани с предстоящия бунт. За последен път Апостола минава през Горна Оряховица през 1872 г. В Исторически музей – Горна Оряховица основна част от експозицията е посветена на освободителните движения, включително създаването на революционния комитет. Бюст паметник на Левски от мрамор се издига в квартал „Пролет” в Горна Оряховица, открит през 1973 г., скулптор Йордан Гаврилов.","name":"Горна Оряховица"},"geometry":{"type":"Point","coordinates":[25.68899252071824,43.12454292001919]}},{"type":"Feature","properties":{"pathName": "samovodene",
    "gallery": [
        "Брелеф на Васил Левски в Самоводене"
    ],"type":"village","content":"Селото е на пътя от Русе за Велико Търново. В Самоводене Левски е основал революционен комитет. По този повод на 18 юли 2012 г. в центъра на селището е открит барелеф на Васил Левски от бял врачански камък. Автор на проекта и изпълнител е Чавдар Велчев.","name":"Самоводене"},"geometry":{"type":"Point","coordinates":[25.60364382964567,43.13900139820535]}},{"type":"Feature","properties":{"pathName": "liaskovets",
    "gallery": [
        "Орелеф на Васил Левски в Лясковец"
    ],"type":"town","content":"Лясковският комитет е определян от изследователите като най-дейният комитет в Търновско. На фасадата на дома на Марин Станчев – един от съратниците на Васил Левски в града (ул. „Васил Левски“ № 89) е поставена паметна плоча с текст: „В тази къща е живял революционерът Марин Станчев (1836–1904 г.) другар и съратник на Васил Левски. Тук са отсядали Г. С. Раковски, Ангел Кънчев, Димитър Общи и др.“ Орелеф на Васил Левски от камък е поставен в централната част на Лясковец. Автор е живописецът Пламен Тодоров.","name":"Лясковец"},"geometry":{"type":"Point","coordinates":[25.714368766995698,43.10259938655458]}},{"type":"Feature","properties":{"pathName": "svishtov",
    "gallery": [
        "Паметен знак с лика на Апостола в Свищов"
    ],"type":"town","content":"Според спомени на Яни Станчев при едно идване в Свищов Васил Левски пренощувал в града в неговия дом, а сам той го улеснил да премине във Влашко, като го снабдил с пари. На мястото, където се е намирал домът на Яни Станчев – в ДГ „Васил Левски“, ул. „Д. Шишманов“ № 16, има поставен паметен знак с лика на Апостола и мраморна плоча.","name":"Свищов"},"geometry":{"type":"Point","coordinates":[25.347594825485935,43.6178542455433]}},{"type":"Feature","properties":{"pathName": "elena",
    "gallery": [
        "Къщата на Иван Кършовски",
        "Паметна плоча на мястото, където е бил Хилендарският метох"
    ],"type":"town","content":"За първи път Левски пристига в Елена през 1869 г. заедно с отец Матей Преображенски. Те се срещат с видни еленски граждани. През 1871 г. Апостола идва в града заедно с Ангел Кънчев и Димитър Общи. Тогава те основават Еленския революционен комитет в родната къща на братята Кършовски. Има исторически документи за дейността на комитета, а запазена бележка на Стоян Робовски показва кои са били членовете му. Председател е Сава Кършовски. Той издава през 1880 г. книга за Апостола „Василий Левски и Ангел Кънчев в Елена“. Заедно с Левски в Първата българска легия участва най-големият от четиримата братя Кършовски – Иван. През 1867 г. Апостола става знаменосец на четата на Панайот Хитов, а главен писар е Иван Кършовски. В четата участва и брат му Кръстю Кършовски. Левски и Иван Кършовски се включват и във Втората българска легия. Паметна плоча за основаването на комитета в Елена е поставена на къщата на Иван Попхристов Кършовски – другар и съратник на Дякона. С паметна плоча е обозначено и мястото, където е бил метохът на Хилендарския манастир. Там Левски се среща в Елена със своя приятел от Втората българска легия архимандрит Галактион.","name":"Елена"},"geometry":{"type":"Point","coordinates":[25.87644264217661,42.93048470552029]}},{"type":"Feature","properties":{"pathName": "biala_cherkva",
    "gallery": [
        "Исторически музей - Бяла черква"
    ],"type":"town","content":"В къщата на Атанас Дончев Ангел Кънчев и Матей Преображенски основават на 28 февруари 1872 г. Белочерковският революционен комитет. В наши дни къщата вече не съществува, но на мястото на старата сграда е поставена мраморна плоча за тези събития, за учредителите на комитета Бачо Киро Петров, Васил Неделчев, Атанас Дончев, поп Гавраил и др. В сградата на Историческия музей са представени всички материали и документи, свързани с участието на Бяла черква в националноосвободителните борби.","name":"Бяла Черква"},"geometry":{"type":"Point","coordinates":[25.307583380625612,43.20627054968923]}},{"type":"Feature","properties":{"pathName": "ruse",
    "gallery": [
        "Къща музей „Баба Тонка“",
        "Паметникът в училището „Васил Левски“",
        "Паметникът на Апостола в „Парка на възрожденците“"
    ],"type":"town","content":"Апостола минава през Русе по време и на двете си обиколки на път за Цариград – от Русе към Варна по железопътната линия, а след това по море до османската столица. Известно е, че на 27 май 1870 г. Левски преминава Дунава от Гюргево към Русе. Там се среща с неговия приятел Христо Иванов-Големия и други родолюбиви младежи. Създаденото през 1867 г. в Русе читалище „Зора“ в последствие става средище на русенските революционери. Левски неколкократно преминава през града, но революционен комитет се основава едва през 1871 г. от Ангел Кънчев. В къща музей „Баба Тонка“, част от Регионален исторически музей – Русе, са експонирани снимки на Левски и на неговия съмишленик Стоил Попов Балкански, с когото Апостола се среща при пребиваванията си в града. Бюст паметник има в училището в града, което носи името на Васил Левски. Паметникът на Апостола в „Парка на възрожденците“ в Русе е изработен по проект на русенския скулптор Даниел Кънчев, открит през 2020 г.","name":"Русе"},"geometry":{"type":"Point","coordinates":[25.949181853740686,43.84300547215593]}},{"type":"Feature","properties":{"pathName": "razgrad",
    "gallery": [
        "Паметникът на Васил Левски в Разград"
    ],"type":"town","content":"В дома на Гани Чернев е създаден революционният комитет в Разград. Скоро е създаден такъв и в село Пороище, ръководен от поп Иван Самоковски. Паметник на Апостола е поставен в двора на ОУ „Васил Левски“.","name":"Разград"},"geometry":{"type":"Point","coordinates":[26.522827755030654,43.52907320815625]}},{"type":"Feature","properties":{"pathName": "targovishte",
    "gallery": [
        "Барелеф с образа на Апостола"
    ],"type":"town","content":"Посещението на Левски в района на Търговище датира от времето, когато той е знаменосец на войводата Панайот Хитов. Вероятно четата минава източно от град Попово по пътя си към Балкана като маршрутът ѝ продължава към с. Пролаз и на юг между Омуртаг и с. Камбурово към селата Горско село и Зелена морава. От там четата се отправя към Котленския балкан. Други данни за активна комитетска дейност в района не са установени. Паметни знаци за Апостола има и в Търговище, и в Попово. Барелеф с образа на Апостола на главната улица в гр. Търговище. Паметник на Апостола в центъра на гр. Попово. Област Разград Област Търговище","name":"Търговище"},"geometry":{"type":"Point","coordinates":[26.571132447183313,43.24550116688758]}},{"type":"Feature","properties":{"pathName": "popovo",
    "gallery": [
        "Паметникът на Апостола в Попово"
    ],"type":"town","content":"Посещението на Левски в района на Търговище датира от времето, когато той е знаменосец на войводата Панайот Хитов. Вероятно четата минава източно от град Попово по пътя си към Балкана като маршрутът ѝ продължава към с. Пролаз и на юг между Омуртаг и с. Камбурово към селата Горско село и Зелена морава. От там четата се отправя към Котленския балкан. Други данни за активна комитетска дейност в района не са установени. Паметни знаци за Апостола има и в Търговище, и в Попово. Барелеф с образа на Апостола на главната улица в гр. Търговище. Паметник на Апостола в центъра на гр. Попово. Област Разград Област Търговище","name":"Попово"},"geometry":{"type":"Point","coordinates":[26.226565355067233, 43.34852551349681]}},{"type":"Feature","properties":{"pathName": "shumen",
    "gallery": [
        "Къща музей „Панайот Волов“",
        "Паметникът на Васил Левски в Шумен"
    ],"type":"town","content":"При липсата на конкретни данни, може да се предполага, че Апостола е минал през Шуменския регион по време на своите пътувания с влак по линията Русе-Варна на път за Цариград, за да осъществи двете си обиколки. До основаване на комитети тук не се стига. Това може да се обясни с наличието на голям брой турски войски и укрепления, но е факт, че през 1873-1875 г., след установяването на Панайот Волов в града, Шуменският комитет е един от най-активните в цялата страна. Къща музей „Панайот Волов“. Паметник на Левски в центъра на град Шумен, 2015 г., скулптор Росица Мишева.","name":"Шумен"},"geometry":{"type":"Point","coordinates":[26.921280539843185,43.27624266021006]}},{"type":"Feature","properties":{"pathName": "silistra",
    "gallery": [
        "Паметникът на Апостола в Силистра",
        "Паметен знак за преминаването на четата на П. Хитов"
    ],"type":"town","content":"Известно е, че четата на Панайот Хитов минава през Силистренския район. Точното място, където тя стъпва на българския бряг не е изяснено, но се смята, че това става източно от Тутракан около с. Пожарево. Паметник на Апостола в центъра на Силистра, ул. „Отец Паисий“ № 12, 2007 г., скулптор Красимир Ангелов. Паметна плоча за преминаването на четата на Панайот Хитов.","name":"Силистра"},"geometry":{"type":"Point","coordinates":[27.258111211590094,44.113544879394006]}},{"type":"Feature","properties":{"pathName": "dobrich",
    "gallery": [
        "Паметникът на Апостола в града"
    ],"type":"town","content":"Няма данни за създаването на комитетска мрежа от Левски в Добричка област. Не е изключено все пак Апостола да е минавал от там след като напуска с. Войнягово и продължава своята учителска дейност в българските села Конгас и Еникьой в Северна Добруджа. Въпреки това, документи за срещи с дейци от този район не са установени. Паметник на Апостола е поставен пред храм „Свети Георги“ в центъра на град Добрич, 1998 г., скулптор Никола Богданов.","name":"Добрич"},"geometry":{"type":"Point","coordinates":[27.829157208367103,43.57695426240757]}},{"type":"Feature","properties":{"pathName": "general_toshevo",
    "gallery": [
        "Паметникът на Апостола в града"
    ],"type":"town","content":"В Генерал Тошево също е издигнат паметник на Левски. Открит е през 2018 г., а негов скулптор е Любомир Добрев.","name":"Генерал Тошево"},"geometry":{"type":"Point","coordinates":[28.035870204370216, 43.69984978496277]}},{"type":"Feature","properties":{"pathName": "balchik",
    "gallery": [
        "Паметникът на Апостола в града"
    ],"type":"town","content":"В Балчик,също е издигнат паметник на Левски. Открит е през 1978 г., а негов скулптор е Веселин Йовчев.","name":"Балчик"},"geometry":{"type":"Point","coordinates":[28.16336158045727, 43.41908870055071]}},{"type":"Feature","properties":{"pathName": "kavarna",
    "gallery": [
        "Паметникът на Апостола в града"
    ],"type":"town","content":"В Каварна също е издигнат паметник на Левски. Открит е през 2008 г., а негов скулптор е Любомир Добрев.","name":"Каварна"},"geometry":{"type":"Point","coordinates":[28.33808556177079, 43.43045895245196]}},{"type":"Feature","properties":{"pathName": "varna",
    "gallery": [
        "Паметна плоча на мястото на фабриката на Н. Провадлиев",
        "Барелеф на Апостола",
        "Паметникът на Левски в Морската градина"
    ],"type":"town","content":"За посещение на Апостола във Варна с апостолска мисия съобщава единствено Иван Фетваджиев в своите „Спомени за Левски“, според които сам той е един от участниците в среща, която Левски провел с революционно настроени варненци. Друг участник в срещата е Никола Провадалиев – един от най-будните за времето си варненци. През 1850 г. той и семейството му се преместват от Провадия във Варна. Провадалиев купува мястото между днешните улици „Ал. Малинов“ и „Марко Балабанов“, построява хан и спиртоварна, в която се е осъществила срещата на варненци с Левски. През 1915 г. на мястото на старата фабрика е построена къща. Там е поставена паметна плоча, отбелязваща идването на Левски. Барелеф на Апостола е поставен на кръстовището на бул. „В. Левски“ и бул. „Осми приморски полк“. Бюст паметник на Левски на Алеята на Възраждането в Морската градина, 1912 г., скулптор Жеко Спиридонов.","name":"Варна"},"geometry":{"type":"Point","coordinates":[27.92224803314126,43.21684042543136]}},{"type":"Feature","properties":{"pathName": "istanbul",
    "gallery": [
        "Балкапан хан",
        "Българската църква „Св. Стефан“"
    ],"name":"Истанбул","type":"town","content":"Истанбул е градът, посещаван от Васил Левски при първите му две обиколки. С кораб по море той стига до османската столица и от там през Одрин преминава към българските земи. Трудно е да се установят в днешния град точни следи от неговото пребиваване, както и да се реконструират аргументирано срещите му там със Стефан Илич, д-р Киро Попов, д-р Христо Стамболски, Иванчо х. Пенчович и други българи и местата, където се осъществяват. Вероятно това са Балкапан хан, западно от моста за Галата, основно средище на българите, наричан още и „българското консулато“ в Цариград преди Освобождението (днес комплексът още функционира търговски – „Балкапан сокак“ №13), българската църква и метохът срещу нея в квартала „Фенер“, между площадите „Балат“ и „Фенер“, на самия бряг на „Златния рог“, домовете и канторите на някои от дейците, с които се среща Апостола."},"geometry":{"type":"Point","coordinates":[28.991646905282302,41.03193056076962]}},{"type":"Feature","properties":{    "pathName": "odrin",
    "gallery": [
        "Църквата „Св. св. Константин и Елена“"
    ],"name":"Одрин","type":"town","content":"Одрин е вторият град в Турция, през който Левски минава при своите обиколки на път за селищата в Тракия. Вероятно посещава църквата „Св. св. Константин и Елена“, реставрирана през 2008 г., в която сега има и музейна сбирка за българите в Одринско и техните традиционни облекла и обичаи. Информация за други населени места в Турция, в които е ходил Апостола не е съхранена, но по пътя между столицата Истанбул и вилаетския център Одрин, той вероятно посещава и други селища с българско население по това време."},"geometry":{"type":"Point","coordinates":[26.56158635992141,41.674361119314]}},{"type":"Feature","properties":{"pathName":"tulcha","name":"Тулча","gallery":[],"type":"town","content":"Категорични данни, че са посещавани от Васил Левски, има за няколко селища, разположени край р. Дунав – Гюргево, Турну Мъгуреле, Бекет, Тулча, Галац, Александрия. През 1866 г., след като напуска с. Войнягово, той се отправя към Северна Добруджа и пребивава в Тулча, Галац, с. Конгас (дн. Дъндуника, окръг Тулча). Разпространява забранени от османските власти литографии на патриотични теми от българското минало."},"geometry":{"type":"Point","coordinates":[28.794024576224444,45.176583052179886]}}, {"type":"Feature","properties":{"pathName": "enikioi",
    "gallery": [
        "Паметна плоча на сградата на старото училище",
        "Старата църква „Св. Св. Кирил и Методий“"
    ],"name":"Еникьой","type":"village","content":"През 1866 – 1867 г. Апостола е учител в с. Еникьой (дн. Михай Когълничано, окръг Тулча). Според спомените на Цаню Захариев, двамата живеят заедно в къщата на Кольо Каябашев. През 2011 г. е поставена паметна плоча на сградата на старото училище, скулптор Христо Илиев от гр. Добрич. Запазена е старата църква „Св. Св. Кирил и Методий“, в която според спомени Дякона е пял по време на служби."},"geometry":{"type":"Point","coordinates":[28.734744116525953, 45.03694682288563]}},{"type":"Feature","properties":{"pathName":"yash","name":"Яш","gallery":[],"type":"town","content":"На 7 ноември 1866 г. Левски е в молдовския град Яш, което се разбира от изпратеното от там негово писмо до Г. С. Раковски. Някои изследователи допускат, че в този период той е посетил и Кишинев (дн. в Молдова) и Болград (дн. в Одеска област, Украйна) и пребивава в този район не да търси някого (например Стефан Караджа), а за да работи за подготвяната за пролетта на следващата година широка четническа акция в Българско."},"geometry":{"type":"Point","coordinates":[27.583690362565566,47.15321049042208]}},{"type":"Feature","properties":{ "pathName": "bucharest",
    "gallery": [
        "Руините на Солаковия хан",
        "Плоча за Любен Каравелов на Солаковия хан",
        "В тази сграда се е помещавало ателието на Карол поп де Сатмари",
        "Плоча напомняща за Общото събрание на БРЦК",
        "Паметникът на Апостола в града"
    ],"name":"Букурещ","type":"town","content":"За съжаление много от местата в столицата на Румъния, най-вече в стария търговски център на града, свързани с Левски и БРЦК, не са запазени в добро състояние, някои са вече разрушени. Могат да бъдат видени руините от сградата, където е живял Любен Каравелов и е била печатницата му на ул. „Каля Мошилор” № 134 (Солаковия хан). В нея Апостола пребивава многократно. Букурещ е градът в Румъния, най-пряко свързан с активната революционна дейност на Васил Левски и БРЦК. Тук пребивава не един път през периода 1868-1872 г., работи с българската емиграция, участва в Общото събрание в края на април и началото на май 1872 г. В Букурещ се фотографира в ателието на Карол поп де Сатмари. Плоча върху жилищен блок на ул. „Корнелиу Копосу“ № 39, до началото на булевард „Христо Ботев“, напомня за проведеното Общо събрание на БРЦК през 1872 г. Паметник на Васил Левски е поставен в парка „Херастръу“ през 2000 г., скулптор Жеко Спиридонов. "},"geometry":{"type":"Point","coordinates":[26.09104330603167,44.422252071283594]}},{"type":"Feature","properties":{"pathName": "tarnu_magureli",
    "gallery": [
        "Паметни плочи на мястото, където е живял Данаил Христов Попов"
    ],"name":"Турну Мъгуреле","type":"town","content":"Гр. Турну Мъгуреле е един от граничните пунктове, през които Левски преминава река Дунав не един път. От там той тръгва и по време на първите си две обиколки. Две паметни плочи са поставени на мястото, където е живял верният съратник на Апостола, плевенчанинът Данаил Попов."},"geometry":{"type":"Point","coordinates":[24.87195183901839,43.74951530913792]}},{"type":"Feature","properties":{ "pathName": "gurgevo",
    "gallery": [
        "Паметна плоча на мястото, откъдето потегля четата на Х. Ботев"
    ],"name":"Гюргево","type":"town","content":"Гр. Гюргево също е място, откъдето Левски преминава във Влашко. В града има многобройно българско население. Той е един от центровете на емиграцията, където е създаден и революционен комитет. През 1875 г. там се провежда и Апостолското събрание (Гюргевският революционен комитет), изработило плана за Априлското въстание. Единственият паметен знак за българско присъствие и революционна дейност в Гюргево е паметната плоча на пристанището, откъдето на 16 май 1876 г. потегля четата на Христо Ботев."},"geometry":{"type":"Point","coordinates":[25.96250815941757,43.8926569975202]}},{"type":"Feature","properties":{"pathName": "braila",
    "gallery": [
        "Плоча на мястото на къщата, където се основава БАН"
    ],"name":"Браила","type":"town","content":"Гр. Браила е един от центровете на българската емиграция през Възраждането. Доказателство за свободолюбивия дух на дедите ни там е църквата „Вознесение Господне“. В църковния двор е плочата с надпис на български и румънски език: „На това място се е намирала къщата, където в 1869 г. българските емигранти поставиха основите на БАН“. Левски е един от учредителите на дружеството, но не присъства лично. Може да се предполага, че Апостола и реално е посетил града, имайки предвид документалните данни, че през 1869 г. той пребивава девет месеца във Влашко, среща се с представители на различни групи и течения в българската емиграция, включително в близкия град Галац."},"geometry":{"type":"Point","coordinates":[27.970442954325808,45.27450871187424]}},{"type":"Feature","properties":{"pathName": "bosilegrad",
    "gallery": [
        "Паметникът на Апостола в Босилеград"
    ],"name":"Босилеград","type":"town","content":"В град Босилеград съшо има паметник на Апостола, скулптор Росица Мишева, 2005 г."},"geometry":{"type":"Point","coordinates":[22.47174215653916, 42.49906083251777]}},{"type":"Feature","properties":{ "pathName": "tsaribrod",
    "gallery": [
        "Паметникът на Апостола в Цариброд"
    ],"name":"Цариброд","type":"town","content":"В град Цариброд съшо има паметник на Апостола, скулптор Валентин Старчев, 2014 г."},"geometry":{"type":"Point","coordinates":[22.77785684775577, 43.015329288581114]}},{"type":"Feature","properties":{"pathName":"nish","name":"Ниш","gallery":[],"type":"town","content":"За съжаление метохът в Ниш, в който отсядат Васил Левски и неговият сподвижник  Генадий Ихтимански, когато през 1862 г. пътуват за Белград, за да се включат в Легията на Г. Раковски, не е запазен. "},"geometry":{"type":"Point","coordinates":[21.899883441905818,43.31895544595908]}},{"type":"Feature","properties":{"pathName":"zaichar","name":"Зайчар","gallery":[],"type":"town","content":"Зайчар е друг град в днешна Сърбия, където през 1868 г. след завръщане от Влашко Левски е арестуван от властите там и хвърлен в тъмница за няколко месеца. Той пише в писмо до Данаил Хр. Попов през 1871 г.: „...и аз на 68-о [лето] бяха затворен в Зайчар в тъмницата, защото съм бил проповядвал на тамошните българи да умират за българщината си, че им е отечество“"},"geometry":{"type":"Point","coordinates":[22.27384334453912, 43.9031863040799]}},{"type":"Feature","properties":{"pathName":"kraguevats","name":"Крагуевац","gallery":[],"type":"town","content":"Съществуват документални свидетелства, че Апостола посещава Крагуевац в края на юни 1862 г., където заедно с група легисти е изпратен под ръководството на дядо Ильо войвода."},"geometry":{"type":"Point","coordinates":[20.916402671558114, 44.010595521219145]}},{"type":"Feature","properties":{"pathName": "belgrad",
    "gallery": [
        "Крепостта Калемегдан",
        "Байраклъ джамия",
        "Старият варош на Белград",
        "Старият варош на Белград",
        "Паметна морена за Левски и Раковски в парка „Ташмайдан“"
    ],"name":"Белград", "type":"town","content":"Крепостта Калемегдан в Белград, където се водят сраженията с турския гарнизон с участието и на българските легисти и днес е едно от най-посещаваните от туристите места в града. Останките от Байраклъ джамия, Варош капия, Видин капия са местата на най-драматичните битки през юни 1862 г. Тук Васил Иванов Кунчев получава и бойното си революционно кръщение и историческото си прозвище „Левски”. Старият варош на Белград с тесните си улички и множество архитектурни останки от османския период също е познал стъпките на Апостола – и като участник в Първата легия, и през месеците след нейното разтуряне, когато изучава абаджийски занаят и посещава казармата, за да усвои по-добре военното дело, а и през 186768 г. като участник във Втората българска легия. През 2008 г. в парка „Ташмайдан“, почти в идеалния център на съвременния град, е поставена паметна морена с образите на Левски и Раковски, дело на Георги Чапкънов. През 19 век „Ташмайдан“ – от турски „каменен площад”, става център на важни събития в Белград. На мястото на днешния паметен знак се е издигала чешма – Чукур чешма, край която в началото на юни 1862 г. турски полицейски патрул убива сръбско дете. Това е искрата, която поражда граждански вълнения и се стига до историческите боеве при крепостта Калемегдан."},"geometry":{"type":"Point","coordinates":[20.452746251217594,44.8124346380099]}}]
}


var pointsGeoJson = {
  "type": "FeatureCollection",
  "features": [{"type":"Feature","properties":{"pathName":"serbia","type":"point","content":"Сърбия е една от съседните страни, където Васил Левски пребивава няколко пъти. Още през 1862 г. желанието да откликне на призива на Георги Раковски повежда дякон Игнатий по пътя от Карлово през Пловдив, Пазарджик, София и Ниш към столицата на тогавашното княжество Сърбия. Заедно с Генадий Ихтимански в началото на април 1862 г. Левски пристига в Белград и се включва в състава на Първата българска легия.","name":"Сърбия"},"geometry":{"type":"Point","coordinates":[21.415888486319734, 43.957204155092725]}},{"type":"Feature","properties":{"pathName":"romania","type":"point","content":"Посещенията и пребиваването на Васил Левски в Румъния или тогавашните Дунавски княжества Влашко и Молдова, са свързани най-вече с периода на активната му организационна дейност за изграждане на ВРО и контактите с БРЦК в Букурещ и българската емиграция оттатък Дунав. Много са селищата, които той посещава или през които преминава Апостола. В тях има и постоянно българско население, и емигранти, напуснали родината в търсене на по-добър живот и стремеж към извоюване на свобода за Отечеството. Най-продължителният престой на Левски във Влашко е от края на август 1869 г. до май 1870 г.","name":"Румъния"},"geometry":{"type":"Point","coordinates":[24.714570022278497, 44.784795464842844]}},{"type":"Feature","properties":{"pathName":"turkey","type":"point","content":"Турция безспорно е една от трите съвременни балкански държави, в която Васил Левски е пребивавал (заедно със Сърбия и Румъния).","name":"Турция"},"geometry":{"type":"Point","coordinates":[27.312661237255902, 41.22770664411023]}}]
}

var bulgariaGeoJson = {
  "type": "FeatureCollection",
  "features": [{"type":"Feature","properties":{"type": "country bulgaria","name": "България"},"geometry":{"type":"Point","coordinates": [25.29989488254214,42.59320995183817]}}]
}

var bulgariaPointGeoJson =  {
  "type": "FeatureCollection",
  "features": [{"type":"Feature","properties":{"pathName":" bulgaria","type":"point bulgaria","content":"Приближете картата, за да опознаете местата, свързани с Васил Левски в България.","name":"България"},"geometry":{"type":"Point","coordinates":[25.270295225747212, 42.63189181330548]}}]};

  var foreigntowns = {
    "type": "FeatureCollection",
    "features": [{"type":"Feature","properties":{"pathName":"istanbul","name":"Истанбул","gallery":[],"type":"town","content":"Истанбул е градът, посещаван от Васил Левски при първите му две обиколки. С кораб по море той стига до османската столица и от там през Одрин преминава към българските земи. Трудно е да се установят в днешния град точни следи от неговото пребиваване, както и да се реконструират аргументирано срещите му там със Стефан Илич, д-р Киро Попов, д-р Христо Стамболски, Иванчо х. Пенчович и други българи и местата, където се осъществяват. Вероятно това са Балкапан хан, западно от моста за Галата, основно средище на българите, наричан още и „българското консулато“ в Цариград преди Освобождението (днес комплексът още функционира търговски – „Балкапан сокак“ №13), българската църква и метохът срещу нея в квартала „Фенер“, между площадите „Балат“ и „Фенер“, на самия бряг на „Златния рог“, домовете и канторите на някои от дейците, с които се среща Апостола."},"geometry":{"type":"Point","coordinates":[28.991646905282302,41.03193056076962]}},{"type":"Feature","properties":{"pathName":"odrin","name":"Одрин","gallery":[],"type":"town","content":"Одрин е вторият град в Турция, през който Левски минава при своите обиколки на път за селищата в Тракия. Вероятно посещава църквата „Св. св. Константин и Елена“, реставрирана през 2008 г., в която сега има и музейна сбирка за българите в Одринско и техните традиционни облекла и обичаи. Информация за други населени места в Турция, в които е ходил Апостола не е съхранена, но по пътя между столицата Истанбул и вилаетския център Одрин, той вероятно посещава и други селища с българско население по това време."},"geometry":{"type":"Point","coordinates":[26.56158635992141,41.674361119314]}},{"type":"Feature","properties":{"pathName":"tulcha","name":"Тулча","gallery":[],"type":"town","content":"Категорични данни, че са посещавани от Васил Левски, има за няколко селища, разположени край р. Дунав – Гюргево, Турну Мъгуреле, Бекет, Тулча, Галац, Александрия. През 1866 г., след като напуска с. Войнягово, той се отправя към Северна Добруджа и пребивава в Тулча, Галац, с. Конгас (дн. Дъндуника, окръг Тулча). Разпространява забранени от османските власти литографии на патриотични теми от българското минало."},"geometry":{"type":"Point","coordinates":[28.794024576224444,45.176583052179886]}},
    {"type":"Feature","properties":{"pathName": "enikioi",
    "gallery": [
        "Паметна плоча на сградата на старото училище",
        "Старата църква „Св. Св. Кирил и Методий“"
    ],"name":"Еникьой","type":"town","content":"През 1866 – 1867 г. Апостола е учител в с. Еникьой (дн. Михай Когълничано, окръг Тулча). Според спомените на Цаню Захариев, двамата живеят заедно в къщата на Кольо Каябашев. През 2011 г. е поставена паметна плоча на сградата на старото училище, скулптор Христо Илиев от гр. Добрич. Запазена е старата църква „Св. Св. Кирил и Методий“, в която според спомени Дякона е пял по време на служби."},"geometry":{"type":"Point","coordinates":[28.734744116525953, 45.03694682288563]}},{"type":"Feature","properties":{"pathName":"yash","name":"Яш","gallery":[],"type":"town","content":"На 7 ноември 1866 г. Левски е в молдовския град Яш, което се разбира от изпратеното от там негово писмо до Г. С. Раковски. Някои изследователи допускат, че в този период той е посетил и Кишинев (дн. в Молдова) и Болград (дн. в Одеска област, Украйна) и пребивава в този район не да търси някого (например Стефан Караджа), а за да работи за подготвяната за пролетта на следващата година широка четническа акция в Българско."},"geometry":{"type":"Point","coordinates":[27.583690362565566,47.15321049042208]}},{"type":"Feature","properties":{"pathName":"bucharest","name":"Букурещ","gallery":[],"type":"town","content":"За съжаление много от местата в столицата на Румъния, най-вече в стария търговски център на града, свързани с Левски и БРЦК, не са запазени в добро състояние, някои са вече разрушени. Могат да бъдат видени руините от сградата, където е живял Любен Каравелов и е била печатницата му на ул. „Каля Мошилор” № 134 (Солаковия хан). В нея Апостола пребивава многократно. Букурещ е градът в Румъния, най-пряко свързан с активната революционна дейност на Васил Левски и БРЦК. Тук пребивава не един път през периода 1868-1872 г., работи с българската емиграция, участва в Общото събрание в края на април и началото на май 1872 г. В Букурещ се фотографира в ателието на Карол поп де Сатмари. Плоча върху жилищен блок на ул. „Корнелиу Копосу“ № 39, до началото на булевард „Христо Ботев“, напомня за проведеното Общо събрание на БРЦК през 1872 г. Паметник на Васил Левски е поставен в парка „Херастръу“ през 2000 г., скулптор Жеко Спиридонов. "},"geometry":{"type":"Point","coordinates":[26.09104330603167,44.422252071283594]}},{"type":"Feature","properties":{"pathName":"turnu_magurele","name":"Турну Мъгуреле","gallery":[],"type":"town","content":"Гр. Турну Мъгуреле е един от граничните пунктове, през които Левски преминава река Дунав не един път. От там той тръгва и по време на първите си две обиколки. Две паметни плочи са поставени на мястото, където е живял верният съратник на Апостола, плевенчанинът Данаил Попов."},"geometry":{"type":"Point","coordinates":[24.87195183901839,43.74951530913792]}},{"type":"Feature","properties":{"pathName":"gurgevo","name":"Гюргево","gallery":[],"type":"town","content":"Гр. Гюргево също е място, откъдето Левски преминава във Влашко. В града има многобройно българско население. Той е един от центровете на емиграцията, където е създаден и революционен комитет. През 1875 г. там се провежда и Апостолското събрание (Гюргевският революционен комитет), изработило плана за Априлското въстание. Единственият паметен знак за българско присъствие и революционна дейност в Гюргево е паметната плоча на пристанището, откъдето на 16 май 1876 г. потегля четата на Христо Ботев."},"geometry":{"type":"Point","coordinates":[25.96250815941757,43.8926569975202]}},{"type":"Feature","properties":{"pathName":"braila","name":"Браила","gallery":[],"type":"town","content":"Гр. Браила е един от центровете на българската емиграция през Възраждането. Доказателство за свободолюбивия дух на дедите ни там е църквата „Вознесение Господне“. В църковния двор е плочата с надпис на български и румънски език: „На това място се е намирала къщата, където в 1869 г. българските емигранти поставиха основите на БАН“. Левски е един от учредителите на дружеството, но не присъства лично. Може да се предполага, че Апостола и реално е посетил града, имайки предвид документалните данни, че през 1869 г. той пребивава девет месеца във Влашко, среща се с представители на различни групи и течения в българската емиграция, включително в близкия град Галац."},"geometry":{"type":"Point","coordinates":[27.970442954325808,45.27450871187424]}},{"type":"Feature","properties":{"pathName":"nish","name":"Ниш","gallery":[],"type":"town","content":"За съжаление метохът в Ниш, в който отсядат Васил Левски и неговият сподвижник  Генадий Ихтимански, когато през 1862 г. пътуват за Белград, за да се включат в Легията на Г. Раковски, не е запазен. "},"geometry":{"type":"Point","coordinates":[21.899883441905818,43.31895544595908]}},{"type":"Feature","properties":{"pathName":"belgrad","name":"Белград","gallery":[],"type":"town","content":"Крепостта Калемегдан в Белград, където се водят сраженията с турския гарнизон с участието и на българските легисти и днес е едно от най-посещаваните от туристите места в града. Останките от Байраклъ джамия, Варош капия, Видин капия са местата на най-драматичните битки през юни 1862 г. Тук Васил Иванов Кунчев получава и бойното си революционно кръщение и историческото си прозвище „Левски”. Старият варош на Белград с тесните си улички и множество архитектурни останки от османския период също е познал стъпките на Апостола – и като участник в Първата легия, и през месеците след нейното разтуряне, когато изучава абаджийски занаят и посещава казармата, за да усвои по-добре военното дело, а и през 186768 г. като участник във Втората българска легия. През 2008 г. в парка „Ташмайдан“, почти в идеалния център на съвременния град, е поставена паметна морена с образите на Левски и Раковски, дело на Георги Чапкънов. През 19 век „Ташмайдан“ – от турски „каменен площад”, става център на важни събития в Белград. На мястото на днешния паметен знак се е издигала чешма – Чукур чешма, край която в началото на юни 1862 г. турски полицейски патрул убива сръбско дете. Това е искрата, която поражда граждански вълнения и се стига до историческите боеве при крепостта Калемегдан."},"geometry":{"type":"Point","coordinates":[20.452746251217594,44.8124346380099]}}]
  };

var countriesGeoJson = {
  "type": "FeatureCollection",
  "features":
[{"type":"Feature","properties":{"type": "country","name": "Румъния"},"geometry":{"type":"Point","coordinates": [24.808311421063074,44.73297659715178]}},{"type":"Feature","properties":{"type": "country","name": "Сърбия"},"geometry":{"type":"Point","coordinates": [21.541020604361503,43.90221941213613]}},{"type":"Feature","properties":{"type": "country","name": "Косово"},"geometry":{"type":"Point","coordinates": [21.097384840502727,42.333422999951004]}},{"type":"Feature","properties":{"type": "country","name": "Македония"},"geometry":{"type":"Point","coordinates": [21.822749255684094,41.32183655478788]}},{"type":"Feature","properties":{"type": "country","name": "Албания"},"geometry":{"type":"Point","coordinates": [20.214199081502898,40.37592407234678]}},{"type":"Feature","properties":{"type": "country","name": "Черна<br>Гора"},"geometry":{"type":"Point","coordinates": [19.380772743934468,42.41875295522557]}},{"type":"Feature","properties":{"type": "country","name": "Босна и<br>Херцеговина"},"geometry":{"type":"Point","coordinates": [17.854992510006603,43.78557013394571]}},{"type":"Feature","properties":{"type": "country","name": "Хърватия"},"geometry":{"type":"Point","coordinates": [16.61243886822056,45.245249968898115]}},{"type":"Feature","properties":{"type": "country","name": "Словения"},"geometry":{"type":"Point","coordinates": [14.661294534302298,45.75562155550836]}},{"type":"Feature","properties":{"type": "country","name": "Унгария"},"geometry":{"type":"Point","coordinates": [19.15715217481995,46.60664193356605]}},{"type":"Feature","properties":{"type": "country","name": "Украйна"},"geometry":{"type":"Point","coordinates": [26.28588492192971,48.91495493499097]}},{"type":"Feature","properties":{"type": "country","name": "Молдова"},"geometry":{"type":"Point","coordinates": [28.772372642507857,46.76776408628982]}},{"type":"Feature","properties":{"type": "country","name": "Гърция"},"geometry":{"type":"Point","coordinates": [22.723045658231342,40.31006785956176]}},{"type":"Feature","properties":{"type": "country","name": "Турция"},"geometry":{"type":"Point","coordinates": [27.469938636829365, 41.202647621497875]}}
]
}

var karlovoRoute = {
  "type": "FeatureCollection",
  "features": [
    {
      "type": "Feature",
      "properties": {},
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            24.80310559272766,
            42.642904975746696
          ],
          [
            24.80358839035034,
            42.64288919169535
          ],
          [
            24.803706407546997,
            42.6428615695959
          ],
          [
            24.804028272628784,
            42.64274318903072
          ],
          [
            24.80460226535797,
            42.642541941553
          ],
          [
            24.805015325546265,
            42.64236436970852
          ],
          [
            24.805508852005005,
            42.6421946894725
          ],
          [
            24.80560004711151,
            42.64215917494591
          ],
          [
            24.806211590766903,
            42.64204473911128
          ],
          [
            24.806383252143856,
            42.64202106270542
          ],
          [
            24.807026982307434,
            42.64198160200897
          ],
          [
            24.807520508766174,
            42.641953979506575
          ],
          [
            24.80762243270874,
            42.641953979506575
          ],
          [
            24.80758488178253,
            42.64189084231216
          ],
          [
            24.80740785598755,
            42.64162645461465
          ],
          [
            24.807177186012268,
            42.641275251308954
          ],
          [
            24.806941151618958,
            42.640892476909016
          ],
          [
            24.806737303733826,
            42.64060440802417
          ],
          [
            24.806571006774902,
            42.64042288448018
          ],
          [
            24.8063725233078,
            42.64022557567958
          ],
          [
            24.806318879127502,
            42.640174275288935
          ],
          [
            24.806222319602966,
            42.6400401048365
          ],
          [
            24.80616331100464,
            42.63991777270125
          ],
          [
            24.806018471717834,
            42.639704677439646
          ],
          [
            24.805750250816345,
            42.639266645998916
          ],
          [
            24.805707335472107,
            42.63916798984356
          ],
          [
            24.80562150478363,
            42.63890359057586
          ],
          [
            24.805573225021362,
            42.638769417383386
          ],
          [
            24.80555176734924,
            42.6385799959133
          ],
          [
            24.805535674095154,
            42.63836689607019
          ],
          [
            24.80555713176727,
            42.638280077406364
          ],
          [
            24.805696606636047,
            42.637810465261424
          ],
          [
            24.805744886398315,
            42.63766050433409
          ],
          [
            24.805755615234375,
            42.63756579198329
          ],
          [
            24.805712699890137,
            42.63741188410577
          ]
        ]
      }
    }
  ]
}

  var balkans = {
    "type": "GeometryCollection", "geometries": [
      { "type": "MultiLineString", "coordinates": [[[22.36541748046875, 42.31184652369511], [22.28851318359375, 42.348395259793], [22.1649169921875, 42.30575300304638], [22.013854980468746, 42.29965889253408], [21.846313476562496, 42.32606244456202], [21.7034912109375, 42.23461834757937], [21.4398193359375, 42.273244264402734], [21.21185302734375, 42.09822241118974], [21.167907714843746, 42.19393393313973], [21.10198974609375, 42.21224516288584], [20.76416015625, 42.06560675405716], [20.753173828125, 41.91045347666418], [20.61859130859375, 41.85319643776675], [20.5389404296875, 41.78360106648078], [20.51422119140625, 41.65034063112266], [20.55816650390625, 41.57641597789266], [20.45928955078125, 41.51680395810118], [20.5609130859375, 41.41183573100123], [20.49224853515625, 41.32320110223851], [20.60211181640625, 41.091772220976644], [20.6817626953125, 41.08349176750823], [20.731201171875, 40.91558813293605], [20.94268798828125, 40.92388970852945], [20.982513427734375, 40.85537053192494], [21.257171630859375, 40.85900590611001], [21.415786743164062, 40.91662588690404], [21.59637451171875, 40.867833841384936], [21.704864501953125, 40.94360177170972], [21.757736206054688, 40.92388970852945], [21.912918090820312, 41.05139515476448], [21.906738281249996, 41.091772220976644], [22.073593139648438, 41.15539335830357], [22.268600463867188, 41.1646985947886], [22.477340698242188, 41.120228320681306], [22.74444580078125, 41.160046141686905], [22.763671875, 41.31907562295139], [22.97515869140625, 41.347948493443546]], [[20.982513427734375, 40.85537053192494], [20.987319946289062, 40.733730386116875], [21.057357788085938, 40.66605624777337], [21.04156494140625, 40.56024300905358], [20.927581787109375, 40.463666324587685], [20.843124389648438, 40.479859145046326], [20.788192749023438, 40.36014911643671], [20.710601806640625, 40.279001825332294], [20.680389404296875, 40.096983167279575], [20.451736450195312, 40.07386810509482], [20.379638671875, 39.99027326196773], [20.42083740234375, 39.8465036024177], [20.3192138671875, 39.73042572969995], [20.1983642578125, 39.65434146406167], [20.00885009765625, 39.690280594818034]], [[26.3287353515625, 41.7180304600481], [26.60064697265625, 41.60312076451184], [26.597900390625, 41.469486382476376], [26.639099121093746, 41.37474755643594], [26.59515380859375, 41.32320110223851], [26.490783691406246, 41.321138395239565], [26.31500244140625, 41.15797827873605], [26.35894775390625, 40.94671366508002], [26.25457763671875, 40.91973905106219], [26.21337890625, 40.83874913796459], [26.048583984374996, 40.72228267283148]], [[21.60736083984375, 42.261049162113856], [21.51947021484375, 42.348395259793], [21.618347167968746, 42.382894009614034], [21.62933349609375, 42.45791402988027], [21.725463867187496, 42.54701017547381], [21.77764892578125, 42.64810165693524], [21.5606689453125, 42.73087427928485], [21.3848876953125, 42.75709622397268], [21.42608642578125, 42.867912483915305], [21.2640380859375, 42.894076403348976], [21.09100341796875, 43.13105676219153], [20.972900390625, 43.12303850442337], [20.82183837890625, 43.26720631662829], [20.5938720703125, 43.197167282501276], [20.69549560546875, 43.1090040242731], [20.6817626953125, 43.038783344984836], [20.489501953125, 42.93229601903058], [20.4510498046875, 42.837709559849614], [20.33294677734375, 42.84375132629021], [20.2203369140625, 42.74902911459619], [20.04180908203125, 42.77322729247907], [20.10498046875, 42.66628070564928], [20.08575439453125, 42.551056983385934], [20.17364501953125, 42.50247797334869], [20.25054931640625, 42.32403179535469], [20.3466796875, 42.33012354634196], [20.5224609375, 42.218347726793304], [20.63507080078125, 41.95336258301847], [20.591125488281246, 41.86956082699455]], [[20.35491943359375, 42.83569550641452], [20.3466796875, 42.91218338638015], [19.973144531249996, 43.06487470411881], [19.8358154296875, 43.09697190802465], [19.764404296875, 43.16311928246929], [19.654541015625, 43.18314981723581], [19.544677734375, 43.247203377359774], [19.44854736328125, 43.395069512861355], [19.22607421875, 43.48481212891603], [19.25079345703125, 43.58635949637695], [19.3634033203125, 43.6102281417864], [19.489746093749996, 43.574421623084234], [19.522705078125, 43.67780454967293], [19.237060546875, 44.00269350325321], [19.37164306640625, 43.95921358836687], [19.51446533203125, 43.95525928989669], [19.62158203125, 44.01849648651216], [19.36614990234375, 44.18614312298759], [19.33868408203125, 44.264871151101985], [19.18487548828125, 44.280604121518145], [19.1162109375, 44.35527821160296], [19.16290283203125, 44.422011314236634], [19.127197265625, 44.52001001133986], [19.335937499999996, 44.74673324024678], [19.34967041015625, 44.85586880735725], [19.1876220703125, 44.92397370210939], [19.10247802734375, 45.021126517829614], [19.0777587890625, 45.125866704733575], [19.201354980468746, 45.19752230305682], [19.3634033203125, 45.1646106517254], [19.38812255859375, 45.236217535866025], [19.171142578125, 45.26715476332791], [18.973388671874996, 45.390735154248894], [19.039306640625, 45.43700828867391], [19.01458740234375, 45.56021795715051], [18.912963867187496, 45.57560020947802], [18.984375, 45.66780526567164], [18.912963867187496, 45.72535642341016], [18.912963867187496, 45.924408558629004], [19.3798828125, 46.03510927947334], [19.5941162109375, 46.18363372751015], [19.84130859375, 46.14178273759234], [20.006103515625, 46.1912395780416], [20.2642822265625, 46.126556302418514], [20.36865234375, 46.00840867976967], [20.50048828125, 45.95496879511337], [20.709228515625, 45.75602615586017], [20.7861328125, 45.763690956618674], [20.819091796874996, 45.56406391514301], [20.7806396484375, 45.50249699389715], [21.0223388671875, 45.32897866218559], [21.2750244140625, 45.24395342262324], [21.434326171875, 45.213003555993964], [21.544189453124996, 45.1510532655634], [21.4727783203125, 45.042478050891546], [21.3739013671875, 45.01141864227728], [21.5826416015625, 44.902577996288876], [21.3739013671875, 44.85586880735725], [21.390380859375, 44.78963254761407], [21.59912109375, 44.762336674810996], [21.62109375, 44.68427737181225], [21.7034912109375, 44.65693173288727], [21.967163085937496, 44.6334823448553], [22.12646484375, 44.484749436619964], [22.1923828125, 44.48866833139464], [22.329711914062496, 44.66865287227321], [22.483520507812496, 44.70380207177485], [22.620849609375, 44.62175409623324], [22.5494384765625, 44.484749436619964], [22.4615478515625, 44.457309801319305], [22.52197265625, 44.34349388385857], [22.67578125, 44.280604121518145], [22.664794921874996, 44.209772586984485]], [[20.313720703125, 46.126556302418514], [20.533447265625, 46.17983040759436], [20.63232421875, 46.14939437647686], [20.8740234375, 46.29381556233369], [21.07177734375, 46.263442671779885], [21.236572265625, 46.40756396630067], [21.24755859375, 46.49082901981415], [21.324462890625, 46.59661864884465], [21.46728515625, 46.649436163350245], [21.51123046875, 46.73986059969267], [21.4892578125, 46.837649560937464], [21.632080078125, 46.86770273172814], [21.697998046875, 47.04766864046083], [21.939697265625, 47.34626718205302], [22.049560546875, 47.39834920035926], [22.03857421875, 47.46523622438362], [22.335205078125, 47.754097979680026], [22.467041015625, 47.746711194756], [22.532958984375, 47.79101617826261], [22.65380859375, 47.77625204393233], [22.972412109375, 48.019324184801185], [23.038330078125, 47.99727386804474], [23.148193359374996, 48.100094697973795], [23.302001953125, 48.06339653776211], [23.477783203124996, 47.96785877999251], [23.807373046875, 47.97521412341618], [23.917236328125, 47.931066347509784], [24.0380859375, 47.945786463687185], [24.180908203125, 47.908978314728714], [24.45556640625, 47.96050238891509], [24.620361328125, 47.945786463687185], [24.730224609375, 47.84265762816538], [24.906005859375, 47.73193447949174], [25.0927734375, 47.754097979680026], [25.257568359375, 47.89424772020999], [25.839843749999996, 47.96785877999251], [26.169433593749996, 47.989921667414194], [26.356201171875, 48.19538740833338], [26.839599609375, 48.23930899024907], [27.1142578125, 47.989921667414194], [27.290039062499996, 47.69497434186282], [27.696533203125, 47.301584511330795], [27.861328125, 47.08508535995386], [28.092041015625, 46.98025235521883], [28.10302734375, 46.81509864599243], [28.245849609375, 46.6795944656402], [28.23486328125, 46.40756396630067], [28.114013671875, 46.24824991289166], [28.10302734375, 46.01985337287631], [28.157958984375, 45.71385093029221], [28.10302734375, 45.57560020947802], [28.19091796875, 45.47554027158593], [28.289794921874996, 45.44471679159555], [28.410644531249996, 45.282617057517406], [28.696289062499996, 45.22074260255366], [28.85009765625, 45.321254361171476], [28.927001953125, 45.29034662473613], [29.267578125, 45.43700828867391], [29.46533203125, 45.42929873257377], [29.608154296874996, 45.336701909968134], [29.68505859375, 45.24395342262324]], [[19.22607421875, 43.51370083689698], [18.9404296875, 43.50523488889796], [19.094238281249996, 43.32767520320563], [19.013214111328125, 43.26170616337345], [18.854598999023438, 43.31968276747214], [18.68499755859375, 43.26020603533182], [18.65203857421875, 43.041794452901534], [18.536682128906246, 43.03175685183966], [18.45977783203125, 42.854322995932606], [18.4735107421875, 42.75558372095005], [18.557968139648438, 42.653656930109726], [18.468017578125, 42.56724159136565], [18.43505859375, 42.48070637541343], [18.520889282226562, 42.41940144722477]], [[20.0830078125, 42.56724159136565], [19.8138427734375, 42.47007098029904], [19.742431640625, 42.53486817758702], [19.7259521484375, 42.656181890253855], [19.610595703124996, 42.58342200132361], [19.56939697265625, 42.508552415528634], [19.4183349609375, 42.36869093640926], [19.412841796875, 42.313877566161864], [19.28375244140625, 42.17765282939429], [19.4073486328125, 42.10026033308264], [19.37164306640625, 42.02685388718981], [19.37164306640625, 41.842966567859406]], [[20.31097412109375, 46.12560451043768], [20.273895263671875, 46.11513371326539]], [[20.3082275390625, 46.12465270201173], [20.32745361328125, 46.13036330589106]], [[26.6143798828125, 48.25028349849022], [26.6802978515625, 48.34894812401375], [26.8450927734375, 48.28319289548349], [26.883544921875, 48.42191010942875], [27.015380859374996, 48.356249029540734], [27.0867919921875, 48.44013426398058], [27.2625732421875, 48.381793961204984], [27.3394775390625, 48.43284538647477], [27.4493408203125, 48.40367941865281], [27.586669921875, 48.48748647988415], [27.6690673828125, 48.43284538647477], [27.773437499999996, 48.44742209577055], [27.97119140625, 48.32703913063476], [28.0975341796875, 48.29781249243716], [28.0975341796875, 48.23930899024907], [28.355712890625, 48.22467264956519], [28.4820556640625, 48.06706753191901], [28.58642578125, 48.17341248658084], [28.80615234375, 48.11476663187632], [28.927001953125, 47.95314495015594], [29.069824218749996, 47.945786463687185], [29.168701171875, 47.97889140226657], [29.2236328125, 47.89056441663247], [29.218139648437496, 47.632081940263305], [29.135742187499996, 47.535746978239125], [29.3060302734375, 47.42437092240519], [29.432373046874996, 47.286681888764214], [29.542236328124996, 47.357431944587034], [29.6136474609375, 47.092565552235705], [29.569702148437504, 46.94276208682137], [29.761962890625, 46.852678248531106], [29.8828125, 46.86770273172814], [29.959716796875004, 46.81885778879603], [29.8992919921875, 46.5286346952717], [30.135498046875, 46.41513877649199], [29.8992919921875, 46.35451083736523], [29.7454833984375, 46.4605655457854], [29.6136474609375, 46.36209301204985], [29.443359375, 46.47191632087041], [29.245605468749996, 46.38483322349276], [29.234619140625004, 46.53997127029103], [28.948974609374996, 46.4605655457854], [28.9874267578125, 46.32417161725691], [28.9599609375, 46.255846818480315], [29.0478515625, 46.1912395780416], [28.9544677734375, 46.08085173686784], [28.992919921875004, 46.027481852486645], [28.7567138671875, 45.96260622242165], [28.778686523437504, 45.832626782661535], [28.7127685546875, 45.775186183521036], [28.564453125, 45.75985868785574], [28.4765625, 45.663966415824056], [28.531494140624996, 45.58713413436411], [28.4271240234375, 45.487094732298374], [28.311767578125, 45.537136680398596], [28.196411132812496, 45.47554027158593]], [[22.365245819091797, 42.31184652369511], [22.38468647003174, 42.31793945446847]], [[26.6143798828125, 48.250340651223276], [26.458253860473633, 48.20471245656077]], [[18.446044921875, 42.512601715736665], [18.424072265625, 42.5733097370664], [18.3526611328125, 42.62183364891663], [18.2373046875, 42.5995982130586], [18.18511962890625, 42.65820178455667], [18.10821533203125, 42.68647341541784], [18.10272216796875, 42.70464124398721], [17.9022216796875, 42.80346172417078], [17.839050292968746, 42.902124607912754], [17.81158447265625, 42.91419494510531], [17.7923583984375, 42.88803956056295], [17.69073486328125, 42.92022922733792], [17.644042968749996, 42.88803956056295]], [[17.58636474609375, 42.938328528472546], [17.718200683593746, 42.974511174899156], [17.6385498046875, 43.09897742494981], [17.43255615234375, 43.18515250937298], [17.402343749999996, 43.2432020009995], [17.33917236328125, 43.257205668363206], [17.2540283203125, 43.40903821777055], [17.2869873046875, 43.46089378008257], [17.2265625, 43.4947753137023], [17.0068359375, 43.574421623084234], [16.74041748046875, 43.78497553389676], [16.70196533203125, 43.85631630786513], [16.50421142578125, 44.02639639912232], [16.44378662109375, 44.02442151965934], [16.424560546875, 44.08363928284644], [16.3311767578125, 44.08561218844469], [16.19384765625, 44.25700308645885], [16.2103271484375, 44.351350365612326], [16.11968994140625, 44.396504700115536], [16.14166259765625, 44.4808302785626], [16.01531982421875, 44.58851118961441], [16.05377197265625, 44.629573191951046], [15.89447021484375, 44.742831723317565], [15.83404541015625, 44.71941709214609], [15.737915039062498, 44.80522439622254], [15.7818603515625, 44.85197466334984], [15.75439453125, 45.0502402697946], [15.831298828124998, 45.20913363773731], [16.00433349609375, 45.21880793965786], [16.182861328125, 45.04053733158767], [16.31195068359375, 45.00170912094224], [16.36962890625, 45.01141864227728], [16.50421142578125, 45.21687321093267], [16.60858154296875, 45.226546196265026], [16.8255615234375, 45.18784438050534], [16.932678222656246, 45.26522168032664], [17.21832275390625, 45.14136744339334], [17.295227050781246, 45.18784438050534], [17.3748779296875, 45.137492653711924], [17.66876220703125, 45.13361760070825], [17.839050292968746, 45.04829981381567], [18.02581787109375, 45.14717913418674], [18.13018798828125, 45.079339209738094], [18.226318359375, 45.09485258791474], [18.25653076171875, 45.14717913418674], [18.43505859375, 45.092913646051144], [18.511962890625, 45.052180659942316], [18.64654541015625, 45.08709642547449], [18.7811279296875, 44.98422783516651], [18.7591552734375, 44.92397370210939], [18.86627197265625, 44.85197466334984], [19.02557373046875, 44.85586880735725], [19.186763763427734, 44.92482450297563]], [[13.58184814453125, 45.47746617959318], [13.6834716796875, 45.44086267178177], [13.79058837890625, 45.460130637921004], [13.903198242187498, 45.423515874347714], [14.00482177734375, 45.469762152630416], [14.0020751953125, 45.515970517182474], [14.20257568359375, 45.465909744214535], [14.23828125, 45.506346901083425], [14.3206787109375, 45.471688258104614], [14.507446289062498, 45.54290788814744], [14.56512451171875, 45.66972459187521], [14.59808349609375, 45.66012730272194], [14.6942138671875, 45.537136680398596], [14.809570312499998, 45.463983441272724], [14.905700683593752, 45.47554027158593], [14.93316650390625, 45.52559248776561], [15.20233154296875, 45.42544355958045], [15.303955078125, 45.454350939222046], [15.3973388671875, 45.487094732298374], [15.29022216796875, 45.62172169252446], [15.402832031250002, 45.63900747494936], [15.35064697265625, 45.71193311776845], [15.328674316406252, 45.67932023569538], [15.2435302734375, 45.7157686770051], [15.389099121093752, 45.79050946752472], [15.468749999999998, 45.79242458189578], [15.487976074218748, 45.832626782661535], [15.581359863281248, 45.84602106744843], [15.655517578124998, 45.82688538784564], [15.71868896484375, 46.056079276178885], [15.61981201171875, 46.0998999106273], [15.59783935546875, 46.15700496290803], [15.68572998046875, 46.23495279600417], [15.770874023437498, 46.21215024064955], [15.80657958984375, 46.263442671779885], [16.083984375, 46.34123949998618], [16.06201171875, 46.38483322349276], [16.15814208984375, 46.40188216826328], [16.2982177734375, 46.37725420510028], [16.30645751953125, 46.39430551701068], [16.24603271484375, 46.5002829039397], [16.3861083984375, 46.53997127029103], [16.66351318359375, 46.45678142812658], [16.77886962890625, 46.375359286114566], [16.79534912109375, 46.382938567526786], [16.88323974609375, 46.33365443192931], [16.89697265625, 46.27103747280261], [17.1661376953125, 46.160809861457125], [17.27325439453125, 46.01794608850014], [17.36114501953125, 45.97024259702345], [17.369384765625, 45.94542053059529], [17.44354248046875, 45.9511496866914], [17.5616455078125, 45.93778073466329], [17.63031005859375, 45.88809640024204], [17.68524169921875, 45.84028105450088], [18.006591796874996, 45.784763729573555], [18.193359375, 45.786679041363726], [18.3526611328125, 45.75602615586017], [18.4515380859375, 45.75219336063106], [18.6492919921875, 45.874712248904764], [18.70697021484375, 45.916765867649005], [18.8031005859375, 45.88044870856469], [18.913307189941406, 45.924408558629004]], [[13.7274169921875, 45.598665689820635], [13.831787109375, 45.583289756006316], [13.903198242187498, 45.62940492064501], [13.7713623046875, 45.763690956618674], [13.524169921874998, 45.85176048817254], [13.6395263671875, 45.947330315089275], [13.4912109375, 46.00840867976967], [13.6669921875, 46.18743678432541], [13.3978271484375, 46.22545288226939], [13.436279296875, 46.3583020562222], [13.7109375, 46.524855311033406], [14.024047851562498, 46.49839225859763], [14.4854736328125, 46.430285240839964], [14.556884765625002, 46.3886223381617], [14.924926757812498, 46.62303384721474], [15.402832031250002, 46.66451741754235], [15.5126953125, 46.60794102560568], [15.8807373046875, 46.717268685073954], [15.963134765625, 46.694667307773116], [15.9686279296875, 46.830133640447386], [16.270751953125, 46.87145819560722], [16.3916015625, 46.67582559793001], [16.571502685546875, 46.484210323012825]], [[16.06201171875, 46.84281614653302], [16.091537475585938, 46.86347752077682], [16.176681518554688, 46.90712199744459], [16.200714111328125, 46.94229329221879], [16.225433349609375, 46.93807395606992], [16.25701904296875, 46.96291637146266], [16.274871826171875, 46.96197913117442], [16.289291381835938, 47.01397113616876], [16.303024291992184, 46.9989876381546], [16.346969604492188, 46.9989876381546], [16.3531494140625, 47.01069385510927], [16.410140991210938, 47.00273390667881], [16.443099975585938, 46.99383609001889], [16.447219848632812, 47.003670432765695], [16.511764526367188, 47.000392519634396], [16.462326049804688, 47.034098593479285], [16.447219848632812, 47.02426985309353], [16.437606811523434, 47.03643850299412], [16.520004272460938, 47.05889641405164], [16.4739990234375, 47.075733642316195], [16.461639404296875, 47.09957727843912], [16.502151489257812, 47.11313066447019], [16.503524780273438, 47.1248118482342], [16.530303955078125, 47.131819327544115], [16.514511108398438, 47.1514353582905], [16.451339721679688, 47.14489748555398], [16.451339721679688, 47.154237057576616], [16.46095275878906, 47.16590921476792], [16.453399658203125, 47.18737928434322], [16.429367065429688, 47.186912636007655], [16.419754028320312, 47.21163934471066], [16.439666748046875, 47.21163934471066], [16.440353393554688, 47.246610279847], [16.478805541992188, 47.2624561696528], [16.488418579101562, 47.27922900257082], [16.459579467773438, 47.33975331313596], [16.434860229492188, 47.35510614717034], [16.452713012695312, 47.36068788874812], [16.447906494140625, 47.40810885284093], [16.45751953125, 47.414149636384714], [16.490478515625, 47.40625001081504], [16.495285034179688, 47.39277144427804], [16.512451171875, 47.39463076190644], [16.511077880859375, 47.40764414848437], [16.569442749023438, 47.40671472747142], [16.650466918945312, 47.44945112101852], [16.668319702148438, 47.47637579720933], [16.6552734375, 47.50096732311069], [16.660079956054688, 47.5079250985124], [16.669692993164062, 47.50421439972969], [16.7047119140625, 47.52230157865766], [16.710891723632812, 47.5394554474239], [16.666259765625, 47.62097541515849], [16.435546875, 47.66538735632654], [16.622314453125, 47.746711194756], [17.083740234375, 47.70976154266637], [17.171630859375, 48.004625021133904], [17.325439453125, 48.004625021133904], [17.68798828125, 47.746711194756], [18.270263671875, 47.746711194756], [18.841552734375, 47.82053186746053], [18.7646484375, 47.99727386804474], [18.907470703125, 48.06339653776211], [19.368896484374996, 48.09275716032736], [19.566650390625, 48.144097934938884], [19.6435546875, 48.246625590713826], [20.0390625, 48.158757304569235], [20.533447265625, 48.53843177405044], [20.885009765625, 48.58932584966975], [21.07177734375, 48.50932644976633], [21.423339843749996, 48.567520373908295], [21.697998046875, 48.39273786659243], [21.851806640625, 48.334343174592014], [22.247314453125, 48.4146186174932], [22.32421875, 48.30512072140391], [22.5, 48.26125565204099], [22.642822265625, 48.09275716032736], [22.818603515625, 48.09275716032736], [22.9010009765625, 47.964180715412276]], [[22.120971679687496, 48.381793961204984], [22.1923828125, 48.629278127969414], [22.379150390625, 48.72358515157852], [22.5, 48.99824008113872], [22.5933837890625, 49.0918551039516], [22.906494140624996, 48.99103162515999], [22.8955078125, 49.09904896047897], [22.692260742187496, 49.18170338770663], [22.7032470703125, 49.48240137826932], [22.65380859375, 49.53946900793534], [22.928466796875, 49.80254124506291], [23.609619140625, 50.352470894936836], [24.01611328125, 50.43651601698633], [23.983154296875, 50.757309850294085], [24.169921875, 50.85450904781293], [23.631591796874996, 51.31688050404585], [23.6865234375, 51.65211086156918], [23.90625, 51.631657349449995], [24.049072265625, 51.60437164681676], [24.400634765625, 51.86292391360244], [25.213623046875, 51.9781134854881], [26.048583984374996, 51.92394344554469], [26.488037109375, 51.80861475198521], [27.191162109375, 51.74743863117572], [27.290039062499996, 51.58389660297626], [27.685546874999996, 51.590722643120145], [27.718505859375, 51.481382896100975], [27.872314453125, 51.631657349449995], [28.30078125, 51.67255514839674], [28.58642578125, 51.58389660297626], [28.773193359374996, 51.41976382669734], [29.15771484375, 51.631657349449995], [29.311523437499996, 51.41291212935532], [29.487304687499996, 51.385495069223204], [29.696044921875, 51.52925135518991], [29.81689453125, 51.43346414054374], [30.179443359375, 51.50190410761811], [30.388183593749996, 51.31001339554934], [30.563964843750004, 51.248163159055906], [30.487060546875, 51.63847621195153], [30.992431640624996, 52.07950600379697], [31.26708984375, 52.06600028274635], [31.5087890625, 52.1267438596429], [31.959228515624996, 52.09300763963822], [32.23388671875, 52.07950600379697], [32.398681640625, 52.328625488430184], [32.8271484375, 52.25470880113083], [33.33251953125, 52.36218321674427], [33.848876953125, 52.348763181988105], [34.1015625, 52.13348804077147], [34.420166015625, 51.7406361640977], [34.1015625, 51.65892664880053], [34.29931640625, 51.248163159055906], [34.6728515625, 51.248163159055906], [34.837646484375, 51.16556659836182], [35.123291015625, 51.24128576954669], [35.2001953125, 51.05520733858494], [35.40893554687499, 51.04830113331224], [35.33203125, 50.94458443495011], [35.61767578125, 50.366488762738264], [36.10107421875, 50.43651601698633], [36.639404296875, 50.233151832472245], [37.46337890624999, 50.45750402042058], [38.045654296875, 49.937079756975294], [38.221435546875, 49.993615462541136], [38.221435546875, 50.099440987634985], [38.331298828125, 50.078294547389426], [38.49609375, 49.993615462541136], [38.97949218749999, 49.816720843571765], [39.166259765625, 49.88755653624285], [39.407958984375, 49.76707407366792], [39.781494140625, 49.56085220619185], [40.111083984375, 49.61782831211117], [40.045166015625, 49.49667452747045], [40.166015625, 49.360911547126165], [40.25390625, 49.24629332459796], [39.70458984374999, 49.05227025601607], [39.83642578125, 48.90805939965008], [40.023193359375, 48.922499263758255], [40.089111328125, 48.828565527993234], [39.8583984375, 48.828565527993234], [39.6826171875, 48.58932584966975], [39.957275390625, 48.34894812401375], [39.803466796875, 47.88688085106901], [38.880615234375, 47.87214396888731], [38.748779296875, 47.68757916850813], [38.3642578125, 47.60616304386874], [38.221435546875, 47.30903424774781], [38.34228515625, 47.264320080254805], [38.24066162109375, 47.21956811231547], [38.22967529296875, 47.11873795272715]], [[20.591125488281246, 41.86962474217837], [20.616788864135742, 41.851662061565385]]] },
      { "type": "LineString", "coordinates": [[22.383956909179688, 42.31793945446847], [22.396316528320312, 42.30676863078423]] },
      { "type": "LineString", "coordinates": [[22.665481567382812, 44.21124911385029], [22.674407958984375, 44.203373876159134]] },
      { "type": "LineString", "coordinates": [[26.330108642578125, 41.71700538790365], [26.308135986328125, 41.72623044860004]] },
      { "type": "LineString", "coordinates": [[26.30847930908203, 41.72597421479714], [26.2847900390625, 41.73750372422637]] }
    ]
  }

  var bulgaria = { "type": "FeatureCollection", "features": [{ "type": "Feature", "properties": {}, "geometry": { "type": "LineString", "coordinates": [[28.5699462890625, 43.74728909225908], [28.443603515625, 43.74332071724287], [28.2183837890625, 43.775060351224695], [27.9656982421875, 43.862257524417934], [27.9217529296875, 44.000717834282774], [27.7789306640625, 43.95328204198018], [27.592163085937496, 44.01257086123085], [27.410888671874996, 44.01652134387754], [27.26806640625, 44.11125397357155], [27.125244140625, 44.13885576756881], [26.8890380859375, 44.12702800650004], [26.7022705078125, 44.07574700247845], [26.3067626953125, 44.02837121279199], [26.1199951171875, 43.96909818325171], [25.9442138671875, 43.87017822557581], [25.7958984375, 43.74332071724287], [25.6695556640625, 43.683763524273346], [25.3070068359375, 43.64005063334696], [25.169677734375, 43.70362249839005], [24.960937499999996, 43.73538317799622], [24.779663085937496, 43.695679697898825], [24.5599365234375, 43.75125720420175], [24.1644287109375, 43.67979094030124], [23.7689208984375, 43.78299262890581], [23.5821533203125, 43.79488907226601], [23.389892578124996, 43.8503744993026], [23.148193359374996, 43.810747313446996], [22.972412109375, 43.80678314779554], [22.8680419921875, 43.854335770789575], [22.873535156249996, 43.98095752608484], [23.0438232421875, 44.067853669357596], [22.664794921874996, 44.20583500104184], [22.631835937499996, 44.071800467511565], [22.423095703124996, 44.01257086123085], [22.357177734375, 43.854335770789575], [22.4725341796875, 43.66389797397276], [22.5384521484375, 43.45690646829029], [22.67578125, 43.393073720674415], [22.7801513671875, 43.38109758727857], [22.9998779296875, 43.12504316740127], [22.906494140624996, 43.068887774169625], [22.69775390625, 42.867912483915305], [22.52197265625, 42.871938424448466], [22.445068359375, 42.807491865911544], [22.5054931640625, 42.742978093466434], [22.4560546875, 42.59757641618889], [22.56591796875, 42.500453028125584], [22.4615478515625, 42.32606244456202], [22.3846435546875, 42.31793945446847], [22.532958984375, 42.14304156290942], [22.862548828125, 42.02481360781777], [22.972412109375, 41.77950486590359], [23.0438232421875, 41.713930073371294], [22.96142578125, 41.63186741069748], [22.972412109375, 41.347948493443546], [23.175659179687496, 41.32320110223851], [23.269042968749996, 41.40153558289846], [23.6151123046875, 41.3850519497068], [23.7689208984375, 41.40565583808169], [23.8897705078125, 41.48389104267175], [24.049072265625, 41.45507852101139], [24.071044921875, 41.529141988723104], [24.296264648437496, 41.51680395810118], [24.54345703125, 41.545589036668105], [24.6368408203125, 41.42625319507269], [25.1312255859375, 41.343824581185686], [25.257568359375, 41.24890252240322], [25.499267578125, 41.30257109430557], [25.6915283203125, 41.30257109430557], [25.8013916015625, 41.347948493443546], [25.900268554687496, 41.31907562295139], [26.092529296875, 41.376808565702355], [26.19140625, 41.43449030894922], [26.158447265625, 41.541477666790286], [26.0595703125, 41.70982942509964], [26.169433593749996, 41.74672584176937], [26.323242187499996, 41.713930073371294], [26.3616943359375, 41.81636125072054], [26.52099609375, 41.828642001860544], [26.60888671875, 41.97582726102573], [26.9769287109375, 42.00848901572399], [27.0263671875, 42.08191667830631], [27.2076416015625, 42.0615286181226], [27.2625732421875, 42.10637370579324], [27.564697265624996, 41.90636538970964], [27.7020263671875, 41.97582726102573], [27.83935546875, 41.947234477977766], [28.048095703124996, 41.983994270935625]] } }] }